{
  "startsAt": 0,
  "numberItems": 28,
  "totalNumberOfItems": 288,
  "hasMore": true,
  "nextStartsAt": 28,
  "searchResults": [
    {
      "applicationUserId": 418202,
      "listingId": 48940,
      "listingName": "Garden of Eating",
      "listingTypeName": "Farmstay",
      "countryName": "Canada",
      "regionName": "Ontario",
      "listingAccommodation": "4",
      "approvedOn": "2015-06-08T13:42:00",
      "isPremium": false,
      "lastUpdated": "2021-01-11T10:29:43.1975908",
      "mainImageUrl": "https://api.helpx.net/images/listing/medium/48940_0.jpg",
      "flagImage": "https://api.helpx.net/images/flag/CAN.png",
      "friendlyUrl": "1301813RS",
      "reviewsReceived": 7,
      "averageRating": 5.0,
      "isFavourite": false,
      "listingDescription": "JANUARY 8 2021 UPDATE: What a year to remember! Farm activities restart in March.\n\nThe farm was established in 2014. It is 2/3rds forested, and 1/3rd fields.\n\nLearn how permaculture (ecological design) is being incorporated into our farm and house build:\n* growing our forest garden (2ac or 0.8ha)\n* cultivating shiitake and oyster mushrooms, plant and graft trees (April-May)\n* picking berries (July)\n* harvesting apples (October)\n\n* optimizing our energy, water, and fertility systems\n* harvest and table at occasional farmers' markets\n* participate in workshops and community projects\n\nI have a permaculture design certificate and specialize in forest gardening, wild and edible plants, mushroom cultivation, site design, water systems, social permaculture, and many more.\n\nExpectations are for guests to help 4h/day which flexes depending on weather, farm task, or leisure activity. We usually cook meals together. For guest stays over 2 weeks we may have additional opportunities available depending on your interest and experience.\n\nI consider every guest as a member of my extended Meaford 'family.' Many guests appreciate my personal attention in incorporating variety into their experiences, or just having someone around to chat if they wish. In addition to the many projects on the farm and house build, I have a number of projects throughout the area so you will have a chance to learn about more permaculturizing places.\n\nWe are blessed with natural beauty and opportunities for hiking, swimming, and kayaking. We have an off-grid trailer with beds or summer tenting, propane appliances, and basic electricity. Accommodations inside the house will be available as house interior construction progresses. We are very close to town and community-minded folks who enjoy live music, reskilling workshops, and film screenings. I try to source local, healthy, and ecologically grown food. I eat meat occasionally and am adaptable to vegans.\n\nMore information and pics on our website.\n\nIn your reply, let me know what interests you, and where you are coming from and when in the event I may be able to find you a ride. Thanks for visiting and look forward to connecting!\n\nIvan\n",
      "lastLogin": "2021-01-11T10:28:32.0866283",
      "allYear": "all year",
      "hideEmail": false,
      "mobile": null,
      "landAreaNumber": null,
      "landAreaUnit": "57",
      "educationOffered": null,
      "organicStatus": true,
      "city": "Meaford",
      "createdOn": "2015-06-07T20:00:00",
      "suburb": "",
      "longitude": null,
      "latitude": null
    },
    {
      "applicationUserId": 419030,
      "listingId": 49769,
      "listingName": "Eastport Organics",
      "listingTypeName": "Farmstay",
      "countryName": "Canada",
      "regionName": "Newfoundland",
      "listingAccommodation": "5",
      "approvedOn": "2010-09-15T11:41:00",
      "isPremium": false,
      "lastUpdated": "2021-01-11T08:11:47.4036898",
      "mainImageUrl": "https://api.helpx.net/images/listing/medium/49769_0.jpg",
      "flagImage": "https://api.helpx.net/images/flag/CAN.png",
      "friendlyUrl": "1533465GR",
      "reviewsReceived": 6,
      "averageRating": 4.83,
      "isFavourite": false,
      "listingDescription": "About 10ha of land mixed in forest, fields and vegetables.\n\nTwo Newfoundland Ponies that need attention, a flock of 30 chickens plus a dog and cat.\n\nExcellent hiking in the area. Newly upgraded trails in the surrounding area with great views of the coastline and ocean. Terra Nova National Park right next door. Ocean playground all around. Explore the beaches and trails of the peninsula by foot and take the dog for a walk at the same time. \n\nFarm located in the middle of a small Newfoundland outport with tourist and summer resident business from June to September. For 2021 still getting things figured out but no big changes from 2020.\n\nStill getting this third generation farm restarted. Lots of land clearing, composting, digging up new beds, fencing, and various construction jobs to keep you busy for shoulder season (May and October).\n\nNew for 2021 will be a wood fired pizza oven being built this spring.",
      "lastLogin": "2021-01-11T08:11:40.0120101",
      "allYear": "Seasonal",
      "hideEmail": false,
      "mobile": null,
      "landAreaNumber": null,
      "landAreaUnit": "10",
      "educationOffered": null,
      "organicStatus": true,
      "city": "Eastport",
      "createdOn": "2010-09-14T20:00:00",
      "suburb": "",
      "longitude": null,
      "latitude": null
    },
    {
      "applicationUserId": 411562,
      "listingId": 42298,
      "listingName": "Forest Gardens",
      "listingTypeName": "Farmstay",
      "countryName": "Canada",
      "regionName": "BC Islands",
      "listingAccommodation": "many",
      "approvedOn": "2018-03-28T01:15:00",
      "isPremium": false,
      "lastUpdated": "2021-01-10T22:45:39.875933",
      "mainImageUrl": "https://api.helpx.net/images/listing/medium/42298_4.jpg",
      "flagImage": "https://api.helpx.net/images/flag/CAN.png",
      "friendlyUrl": "991569MV",
      "reviewsReceived": 0,
      "averageRating": null,
      "isFavourite": false,
      "listingDescription": "The age of fossil fuel powered industrial civilization is rapidly coming to an end. \n\nWhat comes next is up to us.\n\nIn these uncertain times, developing self sufficient and resilient communities through ecological and cultural regeneration, and helping each other along the way, are the most important things we feel we can do.\n\nGuided by the concepts of Permaculture design, regenerative agriculture, and Buddhism, we are developing a hands on learning environment for life in the post industrial age.\n\nIn addition to the physical infrastructure we will need to thrive in the future, rebuilding healthy communities and cultures is an essential part of this transition.\n\nWhile we work together to tend to our gardens, care for the animals, and develop our regenerative farming systems, we also work on establishing the skills we need to be an effective, compassionate and stable community. \n\nThe Garden\n\nWe currently have about 25 000 sq. ft. of no till raised garden beds, including a 3000 sq. ft greenhouse which was finished being installed November 2020. These spaces are planted with a variety of vegetables, herbs, medicinal plants and beneficial insect attracting plants. The beds are irrigated with a gravity fed, low pressure drip system. This year we will focus on creating and developing the garden spaces within the new greenhouse, as well as maintaining the two previously established garden areas.  Amending the soil with compost and compost teas and mulching help us build fertility as we increase production. The garden is a central hub of activity and learning throughout the growing season with lots of work involved in preparing beds, planting, tending, harvesting and preserving the food that’s grown.\n\nThe Permaculture Program\n\nAs part of your season with us, you will have the opportunity to receive certification in our Permaculture Design Course. All educational material will be supplemented with the hands on work we do together on the land. The Apprenticeship program is an introductory level which allows participants to try their hands in all areas including growing, eco-construction, animal care and community building. Core Team members require previous experience in their specialized areas, as they will be leading teams and taking on a more collaborative role in directing the workflow of the season. We are looking for builders, wild crafters, gardeners, and foresters of all levels to join us in advancing their skills towards living a regenerative homestead lifestyle.\n\nFor more details on the specific roles and programs you can apply for you can visit the connect page of our website:\n\nhttps://forestgardens.farm/#connect\n\n",
      "lastLogin": "2021-01-10T23:10:12.7571432",
      "allYear": "Yes",
      "hideEmail": false,
      "mobile": null,
      "landAreaNumber": null,
      "landAreaUnit": "31",
      "educationOffered": null,
      "organicStatus": true,
      "city": "Salt Spring Island",
      "createdOn": "2018-03-27T20:00:00",
      "suburb": "",
      "longitude": null,
      "latitude": null
    },
    {
      "applicationUserId": 421583,
      "listingId": 52323,
      "listingName": "Buddhist community in forest",
      "listingTypeName": "Farmstay",
      "countryName": "Canada",
      "regionName": "Quebec",
      "listingAccommodation": "3 or more",
      "approvedOn": "2011-05-24T00:43:00",
      "isPremium": false,
      "lastUpdated": "2021-01-10T22:25:51.3180909",
      "mainImageUrl": "https://api.helpx.net/images/listing/medium/52323_2.jpg",
      "flagImage": "https://api.helpx.net/images/flag/CAN.png",
      "friendlyUrl": "1988816JI",
      "reviewsReceived": 13,
      "averageRating": 4.77,
      "isFavourite": false,
      "listingDescription": "Français plus bas.\n\nWe are a small Buddhist community living in the forest close to Sainte-Julienne, Quebec. We have an organic fruit tree nursery, along with many other projects on our land: several fruit orchards, chickens and bees, growing our own vegetables and herbs and trying to be independent in many ways.\n\nWe are presently nine permanent people in this little community: Ajan, Eric, Veronique, Mars, Elisabeth, Matthew, Natalie, Eva and Camille The community and the place has grown by itself, starting twenty years ago as Eric`s gift to the monk who taught him meditation. He bought a small tract of land in the forest where at the time there was nothing at all, and has been working ever since then to make this place beautiful and self-reliant, at first with no money, and using mostly recuperated materials.\nEach of us have arrived here one by one, at first just interested in helping out in the place, and then as we found that this lifestyle was for us, deciding to stay for longer.  \n\nThe fruit tree nursery has also grown by itself, beginning as a by-product of human effort combined with the extreme generosity of nature (each tree you plant gives you thousands more seeds to plant after ten years!) Eric`s passion for interesting varieties of fruit trees gradually spilled over into a small business selling some of them. Since then it has grown from one person`s dream of bringing fruit to the northern climate, into a nursery that now sends trees by mail all over Canada. Our aim with the nursery is to help as many people as possible to become self-sufficient and to make their world a little better by planting trees!\n\nWe have recently bought new land with a little lake where we hope to be able to grow all our trees in future. There is also a bigger lake nearby where we like to go and swim when it is hot, and there is a lot of really beautiful forest and nice walks around if you are interested to go hiking. We love to have people to stay with us – we are looking forward to hearing from you!\n\nHelp\n During the summer there is a lot of weeding, learning how to prune trees, mulching, watering and other gardening activities. We will be mulching and bringing organic matter to our land so as to fertilize and improve the soil, and we will be preparing compost tea and other permaculture projects as well.\nLater in summer there is more collection of fruit and nuts, harvesting fruit and vegetables and processing them. We have chickens and bees to take care of, and a great many other ongoing projects in mechanic, construction, etc.\nIn fall and winter there is a lot of nursery work with preparing orders for customers –  digging up trees from the ground (this is one of our favourite jobs!) packing trees, preparing firewood and fires, etc.\n\nThe work can be demanding, especially during the first week or two, and is not suitable for people suffering from back or knee pain.\n\nCultural exchange and learning opportunities\nWe are looking for people who should be passionate about what we do - organic agriculture, fruit trees, gardening or self-sufficiency, simply out of curiosity or because you wish to take on this lifestyle in the future. We will welcome you  a lot if you:\n-have a strong work ethic   \n-are eager to learn,\n-respect our way of living,\n-respect other volunteers on the property,\n-are flexible and adaptable,\n-can follow instructions\n\nHere, we learn by practice: when we give our 200%, we are rewarded!  You can gain a lot of knowledge in many areas(construction, gardening, keeping chickens, sourdough bread, fermenting, welding, mechanics, beekeeping, fruit trees, cooking, carpentry, canning, plumbing, wilderness survival, (as you can tell we have a lot of projects! :)).\nThere often can be classes (completely optional!) about these topics on Sundays or in the evenings, depending on volunteer’s interests.\nIf you happen to have any special interests or knowledge in these or any other subjects, we are also interested in learning from you (especially if you happen to be an expert in baking croissants!  :-) ) We love to learn from other cultures and find new ways to cook, to hear about other gardening techniques and anything else you have to show us :)\nOTHER\nWe practise meditation and Buddhism and have a strict lifestyle. We have a few rules that we follow and ask you to follow when you are hosted on our farm: \n\n-no alcohol or drug\n-no sex (including no touching, no kissing and even no flirting - you are here to learn, you have all the rest of your life for that.)\n-no lying\n-no stealing\n-no killing (insects and animals included). \n\nWe ask you to respect these 5 rules when you are on our land; when you go out of the land, you can do what you want.\n\nPlease note that there are many schools in Buddhism and the one we follow can be quite different from what you know about Buddhism. We don`t have rituals or statues of Buddha, we don`t pray, we don`t do group meditation, we don`t chant. It is basically a work on oneself where we work on developing qualities and removing one`s faults. \n\nWhile it is a big part of our life, it is an inside work and most people will not notice it, but we prefer to let you know just so you can understand our rules a bit better.\n\nAccommodation -\n\nThere is a small house for volunteers to share together, where there are some individual rooms and some shared rooms. Meals are shared with us, the hosts, and usually one person cooks for everyone. Snacks are usually plentiful! If you are comfortable cooking for a large group of people and would like to share your skills in the kitchen with us, you are more than welcome!\n\nWe are non-smokers but we are happy to let you smoke outside the house if you want.\n\nWe do not allow drugs or alcohol on site for several reasons. You have to be okay with this if you are interested in coming here.\n\nQuestions! \nIf you are interested in applying here, \n- Why are you interested in participating in our project?\n\n- How old are you, where are you from, and what is your « life story » (big lines of what you are doing now and what you have done before)?\n\n- When are you interested in coming here and for how long?\n\n- Do you have any experience in gardening or construction (Not having any is not a problem ~ we can teach you.) \n\n- Do you have any skills in a particular field (computers, computer programming, photography, video making, mechanics, sewing, martial arts, bakery, etc.)? Not having any is not a problem.\n\n- Do you have any special diet? Are you vegetarian? If so, are you a strict vegetarian who will not eat a soup that has been stirred with the same spoon that was used to stir a meat stew? \n\n- Any Allergies or health issues we should know?\n\nIt will be a pleasure to read your answers! We generally answer within 24 hours. We really look forward to hearing from you!\n\n\n_____________________________________\n\nFRANÇAIS\n______________________________________\n\nVenez apprendre sur les arbres à fruits et à noix dans une pépinière au Québec!\n\nBonjour!\n\nNous sommes une petite communauté bouddhiste qui vit sur une belle terre entourée de forêt à Sainte-Julienne, au Québec (1 heure de Montréal). Nous avons une pépinière d’arbres fruitiers biologique (pas encore certifiée), en plus d’avoir plusieurs autres projets en cours et en tête! Entre autres, nous avons plusieurs vergers avec des variétés qui viennent de partout dans le monde, des poules, des abeilles, un grand jardin et essayons d’être plus indépendants de plusieurs autres façons.  \n\nNous sommes 8 personnes permanentes dans cette communauté : Ajan, Éric, Véronique, Mars, Élisabeth, Matthew, Natalie, et Eva. La communauté, tout comme l’endroit, a beaucoup grandi au cours des 20 dernières années. Tout cela a commencé par Éric qui souhaitait faire un cadeau au moine qui lui a enseigné la méditation. Il a acheté une petite terre au milieu de la forêt, où il n’y avait rien du tout, et travaille depuis ce temps à rendre cet endroit plus beau et autosuffisant, au départ presque sans argent et principalement avec des matériaux récupérés.  Chacun des membres est arrivé ici au début avec un simple intérêt d’aider brièvement cet endroit spécial et y a ensuite trouvé un but, un style de vie et des valeurs qui l'ont fait s’y établir pour longtemps! \nLa pépinière d’arbres fruitiers a aussi beaucoup évoluée. Tout a commencé par la passion d’Éric combinée à la générosité de la nature (chaque arbre planté donnera des centaines de semences dans 10 ans!). Cette passion d’Éric pour les arbres fruitiers  a attiré l’intérêt de quelques voisins, des gens aux alentours, et maintenant de tout le Canada et même de l’autre côté du globe! Nous consacrons notre temps dans cette pépinière afin d’encourager et d’aider le plus de gens possible à devenir encore plus autosuffisant au niveau alimentaire et de tenter de faire ce monde un monde meilleur en créant une abondance d’arbres fruitiers! \n\nNous avons récemment acheté une nouvelle terre; spacieuse, entourée de forêt, avec un bel étang et deux maisons. Une de ces maisons, la maison bleue, est où les volontaires sont logés et où nous mangeons les repas. Ce nouvel emplacement a pour but de rassembler nos cultures! Nous louons présentement 2 terres afin d’avoir l’espace nécessaire, et les contraintes et les points négatifs nous ont fait prendre cette grande décision.  Dans les environs, il y a les chutes de Rawdon à visiter, des forêts pour aller se balader et des lacs pour se baigner.  \n\n\nDESCRIPTION DU TRAVAIL\n\n\nAu printemps, tout se passe en même temps, préparation de la terre, la plantation, l’empaquetage, le début du désherbage, la plantation du jardin (s’échelonne sur plusieurs mois), ensachage des fruits. La nature est généreuse et florissante ça fait chaud au cœur. \nDurant l’été, il y a beaucoup de désherbage et aussi du paillage, arrosage, taille d’arbres, récoltes, faire du thé de compost, etc. \n\nDurant la fin de l’été, plus de récolte de fruits et légumes, de transformations, soin des arbres et du jardin et divers projets de construction/rénovation, mécanique, etc.\nL’automne n’est pas une période morte pour nous. La fin du jardin annonce le début des commandes ; sortir les arbres de terre, effeuillage, étiquetage, empaquetage, récolte des patates et autres.\n\nL’hiver c’est la fin de l’empaquetage, voilà un peu plus de temps pour entreprendre un projet de rénovation, bûcher du bois de chauffage, faire du greffage, tailler nos arbres fruitiers...\n\n\nLe travail peut être demandant, plus particulièrement durant la première et parfois même la deuxième semaine, et n’est pas adapté pour les personnes ayant des problèmes de dos ou de genoux.\n\nÉCHANGE ET APPRENTISSAGES\n___________________________________\n\nIci, c’est l’apprentissage par la pratique : quand on donne son 100%, on est récompensé. Il y a la possibilité de repartir avec un bagage de connaissances dans plusieurs domaines (construction, jardinage, soudure, plomberie, mécanique, ébénisterie, apiculture, arbres fruitiers, cuisine, pain au levain, fermentation, conserves, déshydratation, survie en forêt, etc.). Il y a souvent des ateliers organisés un soir par semaine et le dimanche selon l’intérêt des volontaires, mais la participation est toujours facultative. Si jamais vous avez un talent ou des connaissances diverses, il nous fera plaisir de vous entendre et d’apprendre de vous! Les nouvelles cultures, manières de vivre et de cuisiner, les connaissances diverses approfondies nous intéressent grandement!\nVous êtes plus que bienvenue si vous:\n- aimez le travail bien fait\n- avez soif d’apprendre\n- êtes respectueux\n- avez une facilité à vous adapter\n\n\nLOGIS ET REPAS\n\nIl y a la maison bleue pour les volontaires, où nous pouvons loger jusqu’à 12 personnes maximum. Il y a 4 chambres individuelles et deux dortoirs. Les repas sont tous inclus et une personne est désignée pour cuisiner pour tous (sauf le dimanche, où chacun peut se concocter son repas ou le faire en groupe!). Les collations et la nourriture sont à volonté et nous avons l’habitude de bien manger. Vous pouvez cuisiner si vous êtes confortable et que cela vous fait plaisir. Nous nous attendons à ce que les volontaires aident au nettoyage de la cuisine après les repas.\nNous sommes non-fumeurs, mais vous pouvez fumer dehors sans problème. \nNous n’acceptons ni l’alcool ni la drogue sur les lieux, c’est une règle importante pour nous.\n__________________________\n\n\nIMPORTANT À SAVOIR\n\nNous pratiquons le bouddhisme dans la vie de tous les jours, il s’agit de travailler constamment sur sa présence d’esprit, à développer ses qualités, à garder l’esprit clair.\nNous respectons un code moral qui nous aide dans ce développement. Nous vous demandons de le suivre avec autant de rigueur que nous durant votre séjour. Le voici :\n- pas d'alcool ni drogue\n- pas de sexualité (incluant toucher, embrasser et même cruiser ou draguer, car vous venez ici pour apprendre, vous avez toute le reste de votre vie pour ça)\n- pas de mensonge\n- pas de vol\n- ne pas tuer (incluant animaux et insectes). \n\nIl est bien de mentionner qu’il y a plusieurs écoles dans le bouddhisme. La pratique que nous faisons et probablement différente de ce que vous connaissez du bouddhisme; nous n’avons pas de rites et rituels, pas de statue de Bouddha, pas de prière, pas de chants, pas de méditation de groupe. Notre pratique est personnelle et constante; c’est un travail intérieur qu’il est difficile de remarquer de l’extérieur.\n\n\nQUESTIONS\n\nSi vous êtes intéressé à venir vous joindre à notre équipe motivée, veuillez inclure les réponses aux questions suivantes dans votre message :\n\n1- Pourquoi êtes-vous intéressée) à participer à notre projet?\n\n2- Quel âge avez-vous, d'où venez-vous, quel est votre parcours de vie (grandes lignes)\n\n3-Quelles dates êtes-vous intéressé(e) à venir ici, et pour combien de temps?\n\n4-Avez-vous de l'expérience en construction ou en jardinage (ne pas en avoir n'est pas un problème, vous êtes ici pour apprendre).\n\n5- Avez-vous des connaissances ou compétences dans un domaine particulier, quel qu’il soit? (ordinateurs, programmation, photographie, montage vidéo, mécanique, couture, arts martiaux, forge, pâtisserie, etc.). \n\n6- Avez-vous un régime alimentaire particulier? Êtes-vous végétarien? Si vous êtes végétarien, êtes-vous le type de végétarien qui ne mangera pas une soupe qui a été brassée avec une cuillère qui a touché à un plat avec de la viande, par exemple?\n\n7- Des allergies ou autres conditions de santé que nous devrions connaître?\n\nAu plaisir de recevoir votre réponse! Nous répondons généralement dans les 24 heures. \n",
      "lastLogin": "2021-01-09T21:51:34.2503834",
      "allYear": "Yes",
      "hideEmail": false,
      "mobile": null,
      "landAreaNumber": null,
      "landAreaUnit": "10",
      "educationOffered": null,
      "organicStatus": true,
      "city": "Rawdon",
      "createdOn": "2011-05-23T20:00:00",
      "suburb": null,
      "longitude": null,
      "latitude": null
    },
    {
      "applicationUserId": 421397,
      "listingId": 52137,
      "listingName": "7 Monster Farm",
      "listingTypeName": "Farmstay",
      "countryName": "Canada",
      "regionName": "Ontario",
      "listingAccommodation": "3 or more",
      "approvedOn": "2015-08-02T23:15:00",
      "isPremium": false,
      "lastUpdated": "2021-01-10T21:26:17.4575408",
      "mainImageUrl": "https://api.helpx.net/images/listing/medium/52137_0.jpg",
      "flagImage": "https://api.helpx.net/images/flag/CAN.png",
      "friendlyUrl": "497572VL",
      "reviewsReceived": 32,
      "averageRating": 4.72,
      "isFavourite": false,
      "listingDescription": "*** I have sufficient space for you for self-quarantining for 15 days ***\n\n** I can pick you up directly from the airport, so you are able to go directly into quarantine. **\n\nI welcome you to stay on a horse and hobby farm!\nHere you can enjoy peace and tranquility, live in plain country side with adorable rescue animals, pick up a lot of skills, and live out your creativity.\n\nThe main tasks are taking care of a variety of very sweet animals:\n2 horses, 2 donkeys, 2 llamas, 4 alpacas, 2 dogs, 2 goats, 2 cats.\nThis takes about 1 hours in the morning and 1 hour in the late afternoon, for 1 helper.\nOf course, if there is a team of helpers splitting this task, it will be shorter.\n\nAdditionally, according to your interests:\n\n- Cooking (mostly vegetarian) for me and the helper team (2 - 4 helpers in winter)\n- Building small shelters for the animals\n- Maintenance (greasing) of farm equipment, tractors, pickup trucks)\n- Helping with building and repairing horse fences (until December)\n- Helping with restoration projects (vintage tractors and vehicles)\n- Splitting fire wood and heating the house with a wood stove\n\nWe cook mostly vegetarian meals. Sometimes also vegan, if there is a vegan person among us.\nAll dietarian needs will be accommodated.\n\nI am happy to teach you driving tractors and pickup trucks, and using all kinds of tools, if needed for the job.\nThere is an awesome, fully equipped workshop.\nI can help you with improving your English. \n\nYou can enjoy here:\n- Two horses to ride, if you are experienced. There are nice trails around the property! As well, there are round pens and a training circuit\n- Your own very comfortable room\n- Large fully (!) equipped kitchen. Helpers taught each other their national recipes!\n- A nice fire place and BBQ\n- TV/video area with tons of DVD's\n- Fitness equipment, sauna and table tennis\n- Bicycles and canoe/kayaks\n- Day trips to Ottawa (30 mins away)\n\nI am looking forward to hearing from you and your ideas!\nHans\n\nPS: This place is only for caring, lovely, motivated, experienced, organized and mature people. \nI am not looking for travelers, who would like to make the cheapest possible vacation!\n\nAbsolutely no drugs, cannabis, nothing of that sort! A glass of wine or beer here and there is ok. \nYou may smoke cigarettes outside. I mean cigarettes, these things with tobacco inside.\n",
      "lastLogin": "2021-01-10T21:25:01.2605461",
      "allYear": "Yes",
      "hideEmail": false,
      "mobile": null,
      "landAreaNumber": null,
      "landAreaUnit": "18",
      "educationOffered": null,
      "organicStatus": true,
      "city": "Kenmore",
      "createdOn": "2015-08-02T23:15:00",
      "suburb": null,
      "longitude": null,
      "latitude": null
    },
    {
      "applicationUserId": 418851,
      "listingId": 49589,
      "listingName": "Paul + Emily",
      "listingTypeName": "Farmstay",
      "countryName": "Canada",
      "regionName": "Vancouver Island",
      "listingAccommodation": "1 or couple",
      "approvedOn": "2020-01-05T13:42:00",
      "isPremium": false,
      "lastUpdated": "2021-01-10T19:52:25.0730365",
      "mainImageUrl": "https://api.helpx.net/images/listing/medium/49589_0.jpg",
      "flagImage": "https://api.helpx.net/images/flag/CAN.png",
      "friendlyUrl": "339844ZZ",
      "reviewsReceived": 2,
      "averageRating": 3.0,
      "isFavourite": false,
      "listingDescription": "** we are now accepting helpers! **\n\nHello everyone! We are a family of 3 (French and Canadian) living in Rural Saanich on beautiful Vancouver island. We are a small scale organic farm growing over 50 different crops and raising animals - chickens, quail, ducks and geese on leased land.\nWe are not a hobby farm, this is our business and it is a unique opportunity for someone to learn about small scale market gardening, from seed to final produce delivered to restaurant, sold at market or even part of our veggies and eggs program (CSA). You will learn a LOT!!!!\nWe start our own seed, we work mostly with hand tools and we try to improve the quality of the soil year after year.\nIn term of working hours, we expect helpers to work 5 days a week and 4-5 hours per day. Duties include the daily care of our mixed poultry and whatever gardening projects are high priority. That will leave you plenty of time to explore the area! there are 2 lakes which are good for swimming, fishing, canoeing, lot of trails, saanich inlet on one side of the peninsula ( lot of wild life such as seals, eagles, porpoise...)  and Juan de fuca strait on the other side ( sand beaches and wild life )\nwe have a canoe, bikes, pogo stick and lot of rain boots you can borrow :)\nRegarding the accommodation we have a cute little trailer perfect for 2:)\nYou will have access to laundry/  your own bathroom/ storage / shower/internet, so much good food, eggs and more!\nOur style of farming requires intense physical labour in various weather conditions, we are looking for people with positive attitude and good work ethic, be aware that tasks can be repetitive.  You must be self motivated and be able to work on your own or as part of a team. the ideal helpers for us will be a couple who can stay for minimum 1 month. Don't hesitate to contact us if you have questions\n\n\n",
      "lastLogin": "2021-01-10T19:49:53.115303",
      "allYear": "year round",
      "hideEmail": false,
      "mobile": null,
      "landAreaNumber": null,
      "landAreaUnit": "",
      "educationOffered": null,
      "organicStatus": true,
      "city": "Victoria",
      "createdOn": "2020-01-05T13:42:00",
      "suburb": null,
      "longitude": null,
      "latitude": null
    },
    {
      "applicationUserId": 421461,
      "listingId": 52201,
      "listingName": "Matt's Berry Farm",
      "listingTypeName": "Farmstay",
      "countryName": "Canada",
      "regionName": "Alberta",
      "listingAccommodation": "3 or more",
      "approvedOn": "2018-10-26T02:43:00",
      "isPremium": false,
      "lastUpdated": "2021-01-10T19:02:37.1570058",
      "mainImageUrl": "https://api.helpx.net/images/listing/medium/52201_0.jpg",
      "flagImage": "https://api.helpx.net/images/flag/CAN.png",
      "friendlyUrl": "1780353DO",
      "reviewsReceived": 1,
      "averageRating": 5.0,
      "isFavourite": false,
      "listingDescription": "This is a farm near Edmonton, Canada.  \r\n\r\nI am REALLY into RECYCLING and REDUCING and REUSING. If you want to learn about this then you might like it with me. I know ALL about that. And I can teach you because I have 30 years of experience with it. I am, on my farm, recycling all kinds of stuff that mainstream society throws away. I am finding ways to divert things from the landfill. I am finding people to reuse items. \r\n\r\nCome help me with my reuse recycle farm idea. It's not just me. See the Rocky Mountains and possibly come for a hike with us. You may possibly take some road trips across Western Canada because sometimes I do road trips. My farm is located JUST outside Edmonton which is a city of over 1 million people. There is ANYTHING you want to do here. Festivals, bars, pubs, nightlife, shopping, cinema, theatre, sports, spectator sports (hockey / football), gymnasiums, ice skating. Edmonton has the biggest urban park of any city in the world I think. There is amazing hiking in the river valley. We have the biggest shopping mall in North America and possibly the best in the world. We have lots of downhill skiing in the Rocky Mountains and also a short drive from my farm. There is a pond on my farm if you want to turn it into a hockey rink (you can shovel the snow off the frozen ice). I can provide skates. I can possibly take you snowmobiling and dog sledding. We have snow shoes and cross country skis for you. You shouldn't be bored in this place. When working you will be cleaning and organizing because we're just setting everything up. Expect hard dirty work but good food.\r\n\r\nThere is UNLIMITED internet access. You can at least catch a ride with me into the city as I drive in almost daily. I also have accommodation for you IN THE CITY so if you want to escape the farm for a weekend you can go into the city to party or sightsee for a couple of days. And then come back to the farm to work for 5 days. I will show you around the city as well. \r\n\r\nI sometimes take road trips into the Rocky Mountains to go hiking. Most of the time you will be on the farm working. When you're not working you can watch movies, satellite TV, use the high speed internet to Skype or WhatsApp your friends. Or just go for walks out in the woods/trees. Maybe use our big recreation room to play billiards or sit by the fireplace with a book and read. Or start a fire out in the back yard and have a wiener roast. \r\n\r\nI will take care of you and teach you English. I will feed you well and show you around my area of Canada and possibly even do a road trip with you. There is UNLIMITED internet for you. There is FREE laundry. You will get all your food provided for you.  \r\n\r\nBut.. Do NOT expect fancy accommodation. You will probably be staying in our home in the basement. Or you might be staying in a motorhome in my back yard. And there will be lots of cleaning, organizing and dirty hard work. If you can't physically do the work I'll put you on lighter duties. You might be helping my wife with cooking and childcare. You might be helping me clean up my messy yard. Or maybe I'll just get you to do some computer work for me if that is what you prefer. ",
      "lastLogin": "2021-01-10T12:06:04.0246709",
      "allYear": "Yes",
      "hideEmail": false,
      "mobile": null,
      "landAreaNumber": null,
      "landAreaUnit": "",
      "educationOffered": null,
      "organicStatus": true,
      "city": "Sturgeon County",
      "createdOn": "2018-10-25T20:00:00",
      "suburb": null,
      "longitude": null,
      "latitude": null
    },
    {
      "applicationUserId": 419117,
      "listingId": 49856,
      "listingName": "Birds of a Feather Victoria BnB Resort",
      "listingTypeName": "Hospitality",
      "countryName": "Canada",
      "regionName": "Vancouver Island",
      "listingAccommodation": "1 only",
      "approvedOn": "2014-07-14T15:34:00",
      "isPremium": false,
      "lastUpdated": "2021-01-10T16:23:30.7440432",
      "mainImageUrl": "https://api.helpx.net/images/listing/medium/49856_0.jpg",
      "flagImage": "https://api.helpx.net/images/flag/CAN.png",
      "friendlyUrl": "482201BP",
      "reviewsReceived": 9,
      "averageRating": 4.67,
      "isFavourite": false,
      "listingDescription": "Purpose built B&B with private self-contained suites. We remain fully operational except we are not serving breakfast to the guests this year.\r\n\r\nEnjoy canoeing, kayaking, biking & hiking at our waterfront B&B. You'll live in a private room.\r\n\r\nMarch through October:\r\nGardening, yard work, helping around the BnB with all aspects of running a home-based business including light cooking, serving, cleaning rooms, crewing on our boat.\r\n\r\nNovember through March:\r\nLow season we mostly need help with housekeeping. If you have experience with digital marketing you can also assist us and/or learn from us (we own a digital marketing company)\r\n\r\nHere`s what a typical summer day looks like.\r\n7:30 am we`re in the kitchen preparing breakfast. 8:30 - 10:00 serving breakfast to guests and interacting with Q&A and booking a few excursions, cleaning kitchen then 11:00 is check out - cleaning rooms from now until 2:30 pm ... depending on number of checkouts this could be a 30 minute tidy, or a 3 to 4 hour full on clean. \r\n\r\nTime Off: 2 full days off.\r\n\r\nPerks: Sharing this beautiful space. Kayaking, canoeing, bike riding, hiking trails. Zip line 20 minutes away. Adrenaline aerial tree course up the road.\r\n\r\nWe are often able to get you a complimentary pass for whale watching and some other recreational activities. Authentic Thai food.\r\n\r\nAlso ideal if you want to get experience in what it means to run a small business, and/or specifically get some experience in the tourism and hospitality sector.\r\n\r\nThis is 100% NO CIGARETTE SMOKING / NO VAPING property. If you`re still at the point in your life where partying is your primary focus then this is not suitable for you.\r\n\r\nACCEPTING ONLY 1 HELPER AT ANY TIME - we do not accept couples as this displaces the personality (ours) of the B&B.",
      "lastLogin": "2021-01-10T16:23:24.5083479",
      "allYear": "Yes",
      "hideEmail": false,
      "mobile": null,
      "landAreaNumber": null,
      "landAreaUnit": "",
      "educationOffered": null,
      "organicStatus": false,
      "city": "Victoria",
      "createdOn": "2014-07-13T20:00:00",
      "suburb": "Colwood",
      "longitude": null,
      "latitude": null
    },
    {
      "applicationUserId": 419151,
      "listingId": 49890,
      "listingName": "Happy Pig Organic Farm",
      "listingTypeName": "Farmstay",
      "countryName": "Canada",
      "regionName": "BC Northern",
      "listingAccommodation": "1 or 2",
      "approvedOn": "2014-05-13T04:57:00",
      "isPremium": false,
      "lastUpdated": "2021-01-10T14:03:05.1842781",
      "mainImageUrl": "https://api.helpx.net/images/listing/medium/49890_0.jpg",
      "flagImage": "https://api.helpx.net/images/flag/CAN.png",
      "friendlyUrl": "1975262AH",
      "reviewsReceived": 1,
      "averageRating": 5.0,
      "isFavourite": false,
      "listingDescription": "Family owned and operated Certified organic livestock farm in North Central British Columbia is looking for help with the farm for four to five hours per day in exchange for a place to park a camper, tent, or stay in our home,  (We also have tents or camper you could use).  \r\nWe have openings after May 2019.\r\nAccess to clean water source, electricity, internet, phone, laundry facilities and great organic food!\r\nWe love to cook and try new foods.\r\nWe are located in the Bulkley Valley with mountains, large rivers, boreal forests and plenty of wild game (black and grizzly bears, moose, elk, deer, etc).  \r\nYou can fly here from Vancouver, drive up, or take the bus.  Inexpensive flights are available into Smithers if you book two weeks ahead.\r\nRides into town are not a problem several times per week, our farm is about 20 minutes East of the town of Smithers.  \r\nGreat cross country and boarding or downhill skiing in the winter and lots of mountains, lakes and trails for playing in the summer.\r\nIndividuals or couples welcome, we eat meat but you don`t have to!  \r\nYou could help us run our mobile food truck selling only organic products with most coming from our farm.  We operate our food truck throughout the summer at regional music festivals and our local farmers market which starts in April.  Food truck is shut down between November and April.\r\nWe raise Berkshire pigs, Dexter cattle, Katahdin sheep, broiler chickens, turkeys and egg laying chickens.  We also have two labrador retrievers (Tut and Sheena) and three guard Alpaca`s.\r\nWe are flexible with time commitments but prefer four week stays.\r\nHard working family that is really easy to get along with.  We need help any time of year!  Volunteer dovetail timber cabin is 90% complete...we also have a converted school bus camper for volunteers.",
      "lastLogin": "2021-01-10T14:02:59.4491895",
      "allYear": "Yes",
      "hideEmail": false,
      "mobile": null,
      "landAreaNumber": null,
      "landAreaUnit": "130",
      "educationOffered": null,
      "organicStatus": true,
      "city": "Telkwa",
      "createdOn": "2014-05-12T20:00:00",
      "suburb": "",
      "longitude": null,
      "latitude": null
    },
    {
      "applicationUserId": 416423,
      "listingId": 47161,
      "listingName": "Hampton Farm",
      "listingTypeName": "Farmstay",
      "countryName": "Canada",
      "regionName": "Nova Scotia",
      "listingAccommodation": "2",
      "approvedOn": "2017-09-02T00:38:00",
      "isPremium": false,
      "lastUpdated": "2021-01-10T13:36:08.0542464",
      "mainImageUrl": "https://api.helpx.net/images/listing/medium/47161_0.jpg",
      "flagImage": "https://api.helpx.net/images/flag/CAN.png",
      "friendlyUrl": "302345XJ",
      "reviewsReceived": 0,
      "averageRating": null,
      "isFavourite": false,
      "listingDescription": "Namaste! Thank you for stopping by. :-) I hope you will join me on my journey for a month, 2 months, or long-term.\r\n\r\nI have a pair of picturesque, riverfront hobby farms, each with a large 4-bedroom house. I am transitioning the farms to more of a communal space with plans for an ashram/yoga retreat in one of the houses.\r\n\r\nThere are three acres of wild blueberries that I want to convert to organic production, six acres of pasture, and about eight acres of woods that provide more than enough firewood to heat both homes without having to clear-cut any areas. We used to have lots of beautiful alpacas, but sometimes life has other plans for us. My partner and I went our separate ways last year, and the alpacas were sold while I was briefly away. I have started rebuilding the alpaca herd, though. Got a real beautiful black alpaca recently. We will create beautiful alpaca fibre items again. :-)\r\n\r\nIn the past, we harvested a small portion of our food from the property, and my vision is to increase that slowly and steadily every year. Some of the new areas of activity that I want to undertake (once the right long-term partners/cohabitants are found) are:\r\n-bee-keeping (which will also help pollinate the blueberry field)\r\n-developing blueberry condiments and other blueberry products\r\n-permaculture\r\n-large vegetable and herb gardens\r\n-alternative, renewable energy to reduce our dependence on the grid\r\n-art studio, as there are a lot of tourists here in the summer\r\n-occasionally playing a bit with my beautiful little children when they are here and, if you are non-English, maybe teaching them a few words of your language\r\n\r\nSo....I need people (short or long term) with the following skills - or at least an interest in these things:\r\n-animal care - this is especially important as I rebuild the alpaca herd\r\n-general farm labour\r\n-fibre arts (processing the alpaca fibre and making things from it)\r\n-a passion for yoga and meditation, to help me develop and put on programs for guests at the ashram\r\n\r\n...and it is always nice to have some company, instead of just me and my sweet cat roaming around this enormous house.\r\n\r\nWere you to stay long-term, I would give you a share of the farm profits. For permanent partners, I would love to have one person in charge of the animals, one person in charge of the fibre production, and one person in charge of additional activities / revenue streams.\r\n\r\nIf/when the two homes ever become full, I plan to start building tiny homes on the property.\r\n\r\nI am amenable to stays as short as three weeks, but I prefer at least a month (or longer, if it turns out that we really have good chemistry). In fact, if someone shares my long-term vision for the homestead, the ashram, and the intentional community that I want to build, I am amenable to them staying permanently. :-) I want to live happily ever after with about 5 or 6 kindred spirits.\r\n\r\nI am LGBT friendly (am personally pansexual and polyamorous).\r\n\r\nI have been vegetarian and try my best to cater to dietary restrictions. Both houses are strictly non-smoking.\r\n\r\nI'm always in need of 2 or 3 helpers here at the beginning of June for the annual shearing of the alpacas. It's a strenuous time that needs a few extra pairs of hands. We also need extra help in the first half of September, as we participate in Open Farm Day, where the public can come to see the alpacas.",
      "lastLogin": "2021-01-09T13:43:27.6651434",
      "allYear": "Yes",
      "hideEmail": false,
      "mobile": null,
      "landAreaNumber": null,
      "landAreaUnit": "5",
      "educationOffered": null,
      "organicStatus": false,
      "city": "Southampton",
      "createdOn": "2017-09-01T20:00:00",
      "suburb": "",
      "longitude": null,
      "latitude": null
    },
    {
      "applicationUserId": 421546,
      "listingId": 52286,
      "listingName": "Kashtin's Misadventures",
      "listingTypeName": "Homestay",
      "countryName": "Canada",
      "regionName": "Yukon",
      "listingAccommodation": "1 or 2",
      "approvedOn": "2019-05-24T16:11:00",
      "isPremium": false,
      "lastUpdated": "2021-01-10T13:24:52.5144337",
      "mainImageUrl": "https://api.helpx.net/images/listing/medium/52286_0.jpg",
      "flagImage": "https://api.helpx.net/images/flag/CAN.png",
      "friendlyUrl": "966320GV",
      "reviewsReceived": 3,
      "averageRating": 5.0,
      "isFavourite": false,
      "listingDescription": "If you are presently anywhere in Canada, I can host you at my place in Yukon right now!  :)  Because of COVID rules you may have to stay around home to start, but there's still plenty to see and do here.\n\nExperience the mountains and wilderness of Yukon and parts of Alaska!! From the Midnight Sun in summer to Northern Lights in winter, learn why we call it: Yukon,the Magic and Mystery. \n\nHelp me live a rustic wilderness life away from the digital speed of today. We do wilderness adventures, activities and occasionally a roadtrip. Volunteer workers visit as my friends and I call you guests, not workers, so no Work Visa is required!\n\nAlthough the house is located in a wilderness residential community with cellular service and WiFi, we can shut off cell phones and laptops at home, we can use oil lamps for light and wood stove for heat and we can play board games at the kitchen table, or we can watch a DVD movie on a flat screen TV!! \n\nHow better to connect with nature than a dip in natural hot springs or wilderness lakes? While lakes are summer only, there are a few natural hot and warm springs in the area. Some are known, some are secret. ;)\n\nMix all this this with other activities that show the best of Yukon life. Campfires, canoeing, biking, camping and snowshoeing. This is a personal stay where we all share the adventure of wilderness living and help each other or challenge ourselves. “Life truly begins outside our comfort zone.”\n\nI have been hosting almost 10 years, so I need help with creating new hosting ideas, adventures, webpages, Introduction Emails and profiles. Skills in writing, photographing and social media are helpful, but just being in a photograph is helpful too. :)\n\nI do not consider myself old, but I am slowing down and forgetting things, so I prefer those guests who have some empathy and understanding. Guests who will become lifelong friends.  \n\nAs with any volunteer project, accommodation and food are included in exchange for doing everyday needed chores. All adventures, activities and day trips are included too. \n\nGuests that stay a month are preferred and usually get to see or do most everything. Longer stays are welcome.\n\nHelp needed:\n\nI do not ask for work because you would need a Work Visa. I do ask that you visit as a friend and offer to contribute to what is required for daily living like cooking, cleaning, trip planning, meal planning and firewood gathering. Some guests are better at cooking and some are better at packing for trips, so we divide the daily chores as needed. \n\nThis is a personal stay where we are all equals in this adventure of wilderness living or exploring on roadtrips. We are a group of friends and “Happiness is only real when shared.”\n\nAccommodations:\n\nThe accommodations are quite rustic as this is a true wilderness Yukon home. It is also sometimes a little primitive. There is one large heated room with three queen-sized beds, two single beds and a shower room.\n\nOn overnight adventures, accommodation can be a tent (even in the snow!).\n\nShowers are not available at anytime of the day. We must take time to heat the water and run the generator, but you are very welcome to use the outdoor shower or the lake!\n\nI have a medium sized dog that is very lovable and lives in the house. Everyone wants to take him home with them! Please don't! :D \n\nEverything here is really \"Into the Wild\". A place where you check the yard for bears, grumpy caribou or Sasquatches before making that midnight run to the outhouse. \n\nFinally:\n\nThis place is NOT for everyone, you must like wilderness living or wanting to learn. Get out of your comfort zone and have a real adventure! I am more than happy to teach you how. \n\nI can provide all seasonal clothing and camping equipment. All you need to bring is a passport, toothbrush and enthusiasm, I can provide everything else.\n\nThis place runs on the energy and enthusiasm of each guest, and is for those who can make their visit an adventure.\n\nMore information to help you decide:\n\nI want to give you as much information as possible so you can make a well informed decision. I do not want an unhappy guest because they expected something different. Life here is different, an adventure! \n\nStart by viewing my Facebook profile where I keep some postings public.  If you feel comfortable you can Friend me, say HI and learn more about day to day life here. \n\nMy Facebook profile is ONLY about life here and the adventures my guests and I do, and my Facebook Friends are ONLY past, present and future guests, so it can act as a forum for guests to comment, ask questions and to see the friendship I have with past guests and understand why they want to return for a second or third time. \n\nI will ask all prospective guest for an email address, so I can send my Introduction Emails I have created to give you more information on life here, the accommodations, the weather and the adventures and activities we do. \n",
      "lastLogin": "2021-01-10T13:24:44.5674922",
      "allYear": "Yes",
      "hideEmail": false,
      "mobile": null,
      "landAreaNumber": null,
      "landAreaUnit": "0.4",
      "educationOffered": null,
      "organicStatus": false,
      "city": "Tagish",
      "createdOn": "2019-05-23T20:00:00",
      "suburb": null,
      "longitude": null,
      "latitude": null
    },
    {
      "applicationUserId": 419720,
      "listingId": 50459,
      "listingName": "Yellow Point Farms",
      "listingTypeName": "Farmstay",
      "countryName": "Canada",
      "regionName": "Vancouver Island",
      "listingAccommodation": "2 only",
      "approvedOn": "2019-09-24T11:49:00",
      "isPremium": false,
      "lastUpdated": "2021-01-10T12:57:16.4419738",
      "mainImageUrl": "https://api.helpx.net/images/listing/medium/50459_0.jpg",
      "flagImage": "https://api.helpx.net/images/flag/CAN.png",
      "friendlyUrl": "1216544KE",
      "reviewsReceived": 4,
      "averageRating": 5.0,
      "isFavourite": false,
      "listingDescription": "We are seeking two helpers  to come stay with us at our farm on Vancouver Island starting around March 1, 2021. Spring is a busy time on the farm, with lots of baby animals being born.  The helpers will have many tasks to do on the farm, which include livestock chores: feeding, watering, cleaning out animal stalls, and horticulture work such as planting, transplanting, weeding, pruning and harvesting. In the summer you might be required to work at our farm stand or at the local farmers market. Our farm is a bountiful place with an abundance of fresh produce, and lots to do nearby such as hiking, bike riding, exploring nearby rivers, beaches and lakes, etc. Due to being in a rural setting, having your own vehicle is advantageous as it makes getting around much easier.  We aren't near a bus route unfortunately.  It’s not mandatory but it is a bonus. Plus, there are many awesome day trips to explore on Vancouver Island such as Tofino, Victoria, and the gulf islands on your days off.\n\nWe are a diverse family farm located in Yellow Point.  We have a mission of creating a well-balanced ecosystem and rich soils that produce nutrient-dense foods while treating the environment and the animals with respect.  We use all organic methods in our farming practice, however we are not certified. \n\nCurrently we grow blueberries, garlic, and other seasonal produce, plus we have miniature goats, sheep, pigs, and poultry.  \n\nNo prior experience is necessary, however preference will be given to those with some farming, gardening or harvesting experience. And, you must love animals! Must be able to work 25-28 hours per week and be willing to learn and be self motivated. Room and board is provided.  You usually work approximately 5-6 hours per day, 5 days per week, with 2 consecutive days off to explore the island, go on an overnight trip, etc.  Preference will be given to a couple, who can stay for a longer term.  We mostly eat food we grow ourselves or source locally.  Being a busy family with young kids, you will be able/required to prepare most of your own meals, and we will eat dinner together every now and then.  You will stay in your own private \"tiny house\" with it's own kitchen. The sleeping arrangements is one loft queen bed. Wifi is available.  Please note: there is only an outdoor shower attached to the tiny home, as well as a compost toilet and outhouse available.  it's rustic but cute. You are welcome to use the facilities anytime in our main house, such as full washroom and laundry. \n\nA 14 day quarantine is possible here at the farm if coming internationally.  You have separate accommodation from the host. ",
      "lastLogin": "2021-01-10T12:50:04.435094",
      "allYear": "Yes",
      "hideEmail": false,
      "mobile": null,
      "landAreaNumber": null,
      "landAreaUnit": "32",
      "educationOffered": null,
      "organicStatus": true,
      "city": "Ladysmith",
      "createdOn": "2019-09-23T20:00:00",
      "suburb": "",
      "longitude": null,
      "latitude": null
    },
    {
      "applicationUserId": 420957,
      "listingId": 51697,
      "listingName": "Hildegund Janzing",
      "listingTypeName": "Homestay",
      "countryName": "Canada",
      "regionName": "Quebec",
      "listingAccommodation": "1 or 2",
      "approvedOn": "2012-03-10T18:40:00",
      "isPremium": false,
      "lastUpdated": "2021-01-10T09:44:00.8062313",
      "mainImageUrl": "https://api.helpx.net/images/listing/medium/51697_0.jpg",
      "flagImage": "https://api.helpx.net/images/flag/CAN.png",
      "friendlyUrl": "1943654UI",
      "reviewsReceived": 6,
      "averageRating": 5.0,
      "isFavourite": false,
      "listingDescription": "We are a french and german speaking family with four children aged between 20 and 26 years old who don't live with us anymore.  We live in a historic house which we renovate by ourselves. A pony and two cats complete our family, somtimes we have chickens and sheeps.  \n\nMichel is cabinet maker and artist. You can see his work on www.zonevert.ca/michel-bachelet. I am psychologist and playtherapist. We are all volunteering a lot: since 2009, we organize the Quebec International Mask Festival (www.masqalors.ca).\n\nOur home is in the countryside, there are trails for walking, cross-country-skiing and cycling. We are located 7km from the village of Saint-Camille where we actively participate in its rich cultural and social life.\n\nWe are looking for Helpers who enjoy working in renovation, interior and exterior painting... We'd appreciate a helping hand in the kitchen, the garden and around the house,...\n\nWe are 8km from Mont-Ham Mountain: www.montham.ca\nand 7km from the cultural centre Le P'tit Bonheur: www.ptitbonheur.org\n\nThis fall and winter, we need help with all kind of work, especially renovation and painting since we bought an old presbyterian church last summer. And also for gardening...\n\n\nNous sommes une famille franco-germano-québécoise avec 4 jeunes entre 20 et 26 ans qui n'habitent plus avec nous. Nous habitons dans une maison ancestrale que nous renovons nous-memes. Un poney et deux chats completent notre famille, parfois nous avons des poules et des moutons. \n\nMichel est ébéniste et artiste (vous pouvez voir son travail sur www.zonevert.ca/michel-bachelet). Pour ma part, je suis psychologue et thérapeute par les arts et le jeu. Nous faisons également beaucoup de bénévolat: depuis 2009, nous organisons le Festival International du Masque (www.masqalors.ca).\n\nNotre maison se trouve en pleine campagne, il y a des chemins pour se promener, faire du velo ou du ski de fond. Nous sommes situes a 7km du village de Saint-Camille ou nous participons activement a la riche vie culturelle et communautaire.\n\nNous aimerions avoir des Helpers qui aiment bien travailler dans la renovation: peinture interieure et exterieure, finitions en bois,... Nous apprecions aussi toute aide dans la cuisine, le menage, le jardin... \n\nNous sommes à 8km du Mont-Ham: www.montham.ca\net à 7km du centre culturel Le P'tit Bonheur: www.ptitbonheur.org\n\nCet automne et cet hiver, nous avons besoin d'aide pour toutes sortes de travaux, en particulier la peinture et la rénovation d'une vieille église presbytérienne que nous avons acheté l'été dernier! \n\nNous acceptons d’accueillir des gens pendant la Covid si vous êtes restés relativement isolés dans les 10 jours précédents. Le risque zéro n’existe pas, mais essayons juste d'être raisonnable :) \n\nMerci!\n",
      "lastLogin": "2021-01-10T09:43:50.7830174",
      "allYear": "Yes",
      "hideEmail": false,
      "mobile": null,
      "landAreaNumber": null,
      "landAreaUnit": "1.6",
      "educationOffered": null,
      "organicStatus": false,
      "city": "Ham-Sud",
      "createdOn": "2012-03-09T19:00:00",
      "suburb": null,
      "longitude": null,
      "latitude": null
    },
    {
      "applicationUserId": 421314,
      "listingId": 52054,
      "listingName": "Thorne Lake Ranch",
      "listingTypeName": "Farmstay",
      "countryName": "Canada",
      "regionName": "Quebec",
      "listingAccommodation": "3 or more",
      "approvedOn": "2017-05-12T11:59:00",
      "isPremium": false,
      "lastUpdated": "2021-01-09T19:31:46.4336674",
      "mainImageUrl": "https://api.helpx.net/images/listing/medium/52054_0.jpg",
      "flagImage": "https://api.helpx.net/images/flag/CAN.png",
      "friendlyUrl": "666290GY",
      "reviewsReceived": 1,
      "averageRating": 5.0,
      "isFavourite": false,
      "listingDescription": "I like meeting people, and especially travellers that are passionate about agriculture and country living.\n\nI have enjoyed my own volunteering and interning experiences on different farms & ranches in Canada and USA a lot, and I've learnt a great deal through them, so I'd like to offer people similar opportunities!\n\n\nCommercial Cattle Ranch - Livestock Farm\nArea of my property: \n360.00acres\nWe are not certified organic, however chemicals are not used for production\n\nManagement Intensive Grazing MIG; Mob Grazing; Low Stress Livestock Handling; Natural Horseman Ship\n\nMethodologies: \nWithout chemicals or pesticides\n\nAnimals: \nBeef Cattle, Goats, Horses, Pigs\nProducts made: \nWholesome Animal Products, Livestock Services\n\nThe Ranch is nestled in the beautiful Ottawa River Valley, right where the rich farmlands of the valley give way to the laurentian shield. The southern part of the ranch is mostly pasture, with the northern part reaching into more rocky terrain that is typical for the laurentians. The land borders Long Lake, with beautiful emerald water, that can be used for swimming etc. Gatineau park is just a few miles east, and Ottawa/Gatineau is approx. 80 km away. Beef Cattle, Goats & Horses are grazed on pasture, and we also raise pastured Pigs. The aim is to produce wholesome, healthy meats that will be supplied directly to consumers, and to provide first class grazing services to other livestock producers. Currently the operation is in the start-up phase. Tasks would include checking, watering, and moving cattle, brush clearing, everything involved in fencing, and  building projects.\n\nIn 2020 there will be more fence building, and also building a horse facility incl. horse shelter for horse boarding.\n\nFeel free to contact me with any questions you may have, either by phone or email.Please leave message if necessary, and I will get back to you!\n\nLooking forward to welcome you to this beautiful spot of Canada!\n\n\n",
      "lastLogin": "2021-01-09T19:31:31.3398461",
      "allYear": "Yes",
      "hideEmail": false,
      "mobile": null,
      "landAreaNumber": null,
      "landAreaUnit": "145.686960",
      "educationOffered": null,
      "organicStatus": false,
      "city": "Bristol",
      "createdOn": "2017-05-11T20:00:00",
      "suburb": null,
      "longitude": null,
      "latitude": null
    },
    {
      "applicationUserId": 409737,
      "listingId": 40473,
      "listingName": "JKL Trail Rides",
      "listingTypeName": "Farmstay",
      "countryName": "Canada",
      "regionName": "Alberta",
      "listingAccommodation": "8",
      "approvedOn": "2016-10-10T17:42:00",
      "isPremium": false,
      "lastUpdated": "2021-01-09T13:29:53.5113082",
      "mainImageUrl": "https://api.helpx.net/images/listing/medium/40473_0.jpg",
      "flagImage": "https://api.helpx.net/images/flag/CAN.png",
      "friendlyUrl": "1606729GM",
      "reviewsReceived": 4,
      "averageRating": 5.0,
      "isFavourite": false,
      "listingDescription": "This is a seasonal trail riding outfit and petting zoo. We are open from May 25th to Sept 15th 2021 We have a very busy summer ahead of us. So far we are booking up fast. We are home to 50 Trail horses and numerous petting zoo critters like, sheep, goats, donkey, exotic cows, llama, alpaca, peacocks, pheasant, parrot, ponies and are very on zebra cross Zony. We are located inside of Wilderness Village Resort just 14 km west of Rocky Mountain House and 1 hour away from the Rocky Mountains.Inside the Resort we have access to pools, hot tubs and a family lounge with wifi. Attractions to see in are area are The Columbia Ice Fields, Abraham Lake, Crimson Lake, Rocky Mountain House Museum just to mention a few. We are 2.5 hrs from both Calgary and Edmonton. If you like camping and riding horses this is the right adventure for you. Chores include feeding, watering, and cleaning the animal pens in the Petting Zoo, leading ponies, Brushing and saddling horses and dealing with the public. We share in making meals and cook out of a outdoor kitchen. Supper time we all eat as a big ranch family around the campfire and share our days fun. Accommodations are a bunkhouse. It’s clean, private and warm:) We also spend time at our mountain location which is a remote camp. It’s very rustic and beautiful. Surround by mountains and right on the Red Deer River it’s truly an amazing place to ride and explore your wild. In 2020 we have some barn building projects and horse related tasks planned. There is a lot of trails to clear and buck up in June before the rides get busy in July and August. We ask for a minimum one month commitment and look for people from May to mid September.",
      "lastLogin": "2021-01-09T13:26:47.221499",
      "allYear": "Yes",
      "hideEmail": false,
      "mobile": null,
      "landAreaNumber": null,
      "landAreaUnit": "160 acres",
      "educationOffered": null,
      "organicStatus": false,
      "city": "Rocky Mountain House",
      "createdOn": "2016-10-09T20:00:00",
      "suburb": "",
      "longitude": null,
      "latitude": null
    },
    {
      "applicationUserId": 420617,
      "listingId": 51357,
      "listingName": "Paul and Becky",
      "listingTypeName": "Farmstay",
      "countryName": "Canada",
      "regionName": "Yukon",
      "listingAccommodation": "1 or couple",
      "approvedOn": "2018-01-31T07:58:00",
      "isPremium": false,
      "lastUpdated": "2021-01-09T13:02:38.186519",
      "mainImageUrl": "https://api.helpx.net/images/listing/medium/818433_Listing.jpg",
      "flagImage": "https://api.helpx.net/images/flag/CAN.png",
      "friendlyUrl": "2255696PF",
      "reviewsReceived": 8,
      "averageRating": 5.0,
      "isFavourite": false,
      "listingDescription": "We are an older couple with a Small 28 acre developing farm located 20 km from Dawson City Yukon on the banks of the beautiful Klondike River, which must be crossed in either a motor boat or canoe.\n\nWe have gardens, goats, chickens and pigs. During the 2021 season there will be weeding of the gardens, making hay, cutting firewood,  picking berries for jams, pickling and preserving vegetables. We are in process of installing a predator fence around the property to help protect the animals and the gardens. This fence needs to be completed. We have a building to move to the property to set up for a barn over the summer, hopefully to be ready to use by fall. The other project we hope to do this summer is build a root cellar to store vegetables over winter. We have a small sawmill for cutting the lumber we need for said projects \n\nWe use organic principles and practices in our growing and animal care but are not registered or certified. \n\n\nIn exchange for help on these projects we have a holiday trailer for you to live in, with outhouse and outside shower. Meals will be at our house with most everything grown on the farm.\n\nWe are looking for summer help May-Oct 15th. We prefer stays to be a minimum of 2 weeks. \n\nRecreational opportunities in the area are fishing, hiking, camping and canoeing. There is lots of gold rush history and historical sights. The town has summer activities most weekends",
      "lastLogin": "2021-01-09T13:00:40.8664387",
      "allYear": "May - October",
      "hideEmail": false,
      "mobile": null,
      "landAreaNumber": null,
      "landAreaUnit": "11.331208",
      "educationOffered": null,
      "organicStatus": true,
      "city": "Dawson City",
      "createdOn": "2018-01-30T19:00:00",
      "suburb": null,
      "longitude": null,
      "latitude": null
    },
    {
      "applicationUserId": 410666,
      "listingId": 41402,
      "listingName": "Auberge Amerik",
      "listingTypeName": "Hospitality",
      "countryName": "Canada",
      "regionName": "Quebec",
      "listingAccommodation": "3 to 5 ",
      "approvedOn": "2009-10-08T20:00:00",
      "isPremium": false,
      "lastUpdated": "2021-01-09T12:27:53.8388024",
      "mainImageUrl": "https://api.helpx.net/images/listing/medium/41402_0.jpg",
      "flagImage": "https://api.helpx.net/images/flag/CAN.png",
      "friendlyUrl": "1117933OV",
      "reviewsReceived": 1,
      "averageRating": 5.0,
      "isFavourite": false,
      "listingDescription": "Hello,\r\n\r\nCome discover one of the most beautiful cities in North America! Quebec is a dynamic, fun city, with permanent activities! We are a small, dynamic hotel encouraging active tourism! In 6 years, we have welcomed a lot of volunteers - it's a rich aspect of our adventure!\r\n\r\nWe ask for a stay of at least 2-3 weeks, as learning the tasks and the routine takes a while. We are also looking for people to stay with us for a longer period - especially in summer, Quebec offers a LOT (Summer Festival, Festibière, Festival de la Nouvelle France ... and we are close to the Old Port, as well as many cycle paths...). Access to the city is very easy because we have a bus stop near our house.\r\nDo not hesitate to contact us quickly. We welcome 4-5 volunteers at the same time.\r\n\r\nWe are looking for volunteers for cleaning in the morning and for reception in the afternoon / evening.\r\nDepending on your knowledge of French (necessary to make the reception), you will help us either with everything or just with the maintenance of the hotel. We work in both French and English languages!\r\nAnd our wonderful Neo Queen Anne style building ALWAYS needs a little love; painting, small renovations and gardening are still on the agenda.\r\nWe always do our best to integrate your knowledge!\r\n\r\nIn return for 4 hours of help per day, 5 days a week, we offer WiFi, bikes and flexible days off, depending on our reservations and other volunteers.\r\nYou are responsible for your food. We do however provide one good meal per day (breakfast or lunch) at our Bistro. There is protein in every meal. Sunday is \"Pasta Party\"!\r\n\r\nYou will stay at the hotel itself, in a private room with shared bathroom or in a fully equipped apartment near the hotel (100 m), either in a private room or shared with another volunteer of the same gender.\r\n\r\nBoth places include high speed WiFi.\r\n\r\nIn free time, you can use our rental bikes to explore the surroundings or relax on our sunny roof terrace.\r\n\r\nThe atmosphere here is nice and very international ... you will be a team with MAGNIFICENT people! You will benefit from a lot of information on sport, the arts and cultural events in Quebec, because it is our daily business :)\r\nMake the most of our city !!!\r\n\r\nTips are shared between volunteers.\r\n \r\nIf you agree with this arrangement, it would be our pleasure to welcome you!\r\n\r\nHave a good day !\r\n\r\nNicola\r\n\r\n\r\n----------\r\nBonjour,\r\n\r\nVenez découvrir l'une des plus belles ville d'Amérique du Nord ! Québec est une ville dynamique, amusante, avec des activités permanentes! Nous sommes un petit hôtel dynamique encourageant le tourisme actif ! En 6 ans, nous avons accueilli énormément  de volontaires - c'est un aspect riche de notre aventure !\r\n\r\nNous demandons un séjour d'au moins 2-3 semaines, car l'apprentissage des tâches et de la routine prend un certain moment. Nous cherchons également de personnes pour rester chez nous une plus longue période - particulièrement en été, Québec offre BEAUCOUP (Festival d'été, Festibière, Festival de la Nouvelle France ... et nous sommes proches du Vieux-Port, ainsi que de nombreuses pistes cyclables...). L'accès à la ville est très facile car nous avons un arrêt de bus à côté de chez nous.\r\nN'hésitez pas à nous contacter rapidement. Nous accueillons 4-5 volontaires en même temps.\r\n\r\nNous cherchons des volontaires pour le ménage pendant l'avant-midi et pour la réception l'après-midi / le soir. \r\nDépendant de tes connaissances du français (nécessité pour faire la réception), tu nous aideras soit avec tout ou juste avec l'entretien de l'hôtel. Nous travaillons dans les deux langues français et anglais!\r\nEt notre merveilleux bâtiment de style Neo Queen Anne a TOUJOURS besoin d'un peu d'amour; peinturer, des petites rénovations et du jardinage sont toujours à l'agenda. \r\nNous faisons toujours le maximum pour intégrer vos connaissances !\r\n\r\nEn retour de 4 heures d'aide par jour, 5 jours sur 7, nous offrons le WiFi, des vélos et des journées de congés flexibles, dépendant de nos réservations et des autres volontaires.\r\nTu es responsable pour ta nourriture. Nous fournissons cependant un bon repas par jour ( petit-déjeuner ou lunch ) à notre Bistro. Il y a des protéines à tous les repas. Le dimanche, c’est « Pasta Party » ! \r\n\r\nTu resteras à l'hôtel-même, dans une chambre privative avec salle de bain partagée ou dans un appartement complètement équipé proche de l'hôtel ( 100 m ), soit dans une chambre privée ou partagée avec un autre volontaire du même sexe. \r\n\r\nLes deux places comprennent du WiFi haute vitesse.\r\n\r\nEn temps libre, tu peux utiliser nos vélos de location pour découvrir les environnements ou relaxer sur notre toit-terrasse ensoleillé.\r\n\r\nL'atmosphère ici est sympa et très internationale ... tu seras en équipe avec des personnes MAGNIFIQUES ! Tu profiteras des beaucoup d'infos sur le sport, les arts et les évènements culturels à Québec, car c'est notre business quotidienne :)\r\nProfite au maximum de notre ville !!!\r\n\r\nLes pourboires sont partagés entre les volontaires.\r\n \r\nSi tu es d'accord avec cet arrangement, cela nous ferait plaisir de t'accueillir!\r\n\r\nBonne journée !\r\n\r\nNicola\r\n",
      "lastLogin": "2021-01-10T14:28:48.7056752",
      "allYear": "Yes",
      "hideEmail": false,
      "mobile": null,
      "landAreaNumber": null,
      "landAreaUnit": "",
      "educationOffered": null,
      "organicStatus": false,
      "city": "Quebec City",
      "createdOn": "2009-10-08T20:00:00",
      "suburb": null,
      "longitude": null,
      "latitude": null
    },
    {
      "applicationUserId": 413365,
      "listingId": 44101,
      "listingName": "Hat Creek Land and Cattle Co. ",
      "listingTypeName": "Farmstay",
      "countryName": "Canada",
      "regionName": "BC South Central",
      "listingAccommodation": "1 or 2",
      "approvedOn": "2014-09-10T01:40:00",
      "isPremium": false,
      "lastUpdated": "2021-01-09T09:09:58.6256539",
      "mainImageUrl": "https://api.helpx.net/images/listing/medium/44101_0.jpg",
      "flagImage": "https://api.helpx.net/images/flag/CAN.png",
      "friendlyUrl": "2087785TN",
      "reviewsReceived": 9,
      "averageRating": 5.0,
      "isFavourite": false,
      "listingDescription": "We are a 500 cow calf ranch, putting 1200 tons of winter feed up, farming, irrigation, cattle movements and calving.  Gardening and general maintenance around the buildings. Located 50 km from town in a valley that runs north to south. Private accommodations are available, prefer a couple because of the distance to town but will take singles. Food supplied. If you like mountains, wildlife and exercise and you are interested in a true country experience this is the place to be. We start calving in March through till Mid April.  For the summer we are haying, moving irrigation pipes,and cattle around. Round up beginning for weaning in November. There are tasks for all skill levels and strengths so don't be afraid to join us. Would like it if you came for a month but short stays are welcomed. We welcome any help and would like people to share their knowledge with us. No experience is necessary just enthusiasm. We start up in March for calving and run through to November.\r\n",
      "lastLogin": "2021-01-10T20:02:54.8625085",
      "allYear": "Not in the winter",
      "hideEmail": false,
      "mobile": null,
      "landAreaNumber": null,
      "landAreaUnit": "41000",
      "educationOffered": null,
      "organicStatus": true,
      "city": "cache creek",
      "createdOn": "2014-09-09T20:00:00",
      "suburb": "cache creek",
      "longitude": null,
      "latitude": null
    },
    {
      "applicationUserId": 419766,
      "listingId": 50505,
      "listingName": "Cindy ",
      "listingTypeName": "Homestay",
      "countryName": "Canada",
      "regionName": "Vancouver Island",
      "listingAccommodation": "1 or 2",
      "approvedOn": "2015-04-27T08:14:00",
      "isPremium": false,
      "lastUpdated": "2021-01-09T02:27:15.5584441",
      "mainImageUrl": "https://api.helpx.net/images/listing/medium/50505_1.jpg",
      "flagImage": "https://api.helpx.net/images/flag/CAN.png",
      "friendlyUrl": "2188364AV",
      "reviewsReceived": 52,
      "averageRating": 4.73,
      "isFavourite": false,
      "listingDescription": "Wow, exploring right outside our backdoor along side the Campbell River on Vancouver Island, is a beautiful place to experience WINTER and Vancouver Island`s great outdoors!!! Although we live on a one acre town lot, our back yard is situated on a cliff over looking an accessible beautiful heritage river, with a nature park setting of ferns, douglas firs, maples and alder trees. You can often see deer, racoons, bears and the silver backs of salmon and Steelhead fish jumping in the ebb and flow of the river’s pools. We have trail access to the river below, where you can enjoy listening to the sing song of many birds, tubing down the river/swimming in the heat of the summer, and trying your hand at casting for Steelhead fish. As well, our neighborhood is the access point to many scenic nature walking and biking trails. The 1st three photos are at our home and the others are nearby nearby trails and local vistas.\n\nIf you have a specific trade or skill to exchange we can find you a suitable project. Otherwise if you can help with any of the following; Fall cleanup in the yard and along the river area and trails, hand man stuff, chain saw, small wood retaining wall and couple of stairs, refinishing or refiguring wood table and the usual weekly interior house cleaning/some organization, \n\nIn the past we have traveled and enjoyed home stays ourselves and therefore, we would really enjoy learning about your country  and you would be treated like a member of our casual family home.  I like to cook and enjoy sharing mealtimes; so you can expect healthy meals and ingredients made fresh daily and therefore your involvement and assistance with meals in the kitchen is a must.. You will be provided with either a private bsmt bedroom with a double bed with an adjacent full bathroom, or our second space is a comfy single bed in the open bsmt concept and the final space being a river view loft/ building adjacent to house (summer months) and you can use the bsmt bathroom in house = your choice. Internet and limited laundry available.\n\nWe have interests in the arts, painting, drawing, yoga, music, theater, cooking, crafting, hiking,snow shoeing, kayaking, camping and canoeing.\n\nHelpers with the following qualities are ideal,\n\n- can work independently, self - motivated, energetic and happy to be helping out\n- team player\n- some experience gardening or a willingness learn and to work hard, as I do \n \n- some meal preparation is done in the morning before starting workday - as well, cooking, daily cleanup of kitchen are part of being a family/team...\n  many hands make for small work:)))- this time is not considered working hours\n- you are required to participate in the making of your meals and the sharing of the same \n  meal time with family regardless of your diet\n- if you require a different diet please discuss these options before you arrive \n- we usually stop for a mid day meal and finish required hours afterwards.\n- you are self motivated to keep your room/or living space and bathroom clean during and \n  before you leave\n- **no drugs**, minimal drinking, smoking outside, \n \n5 days- 5 hours/2 off or 6 days 4 hour/1 off, for total of 25 hours \nI'm looking for happy, fun people to share and spend part of my day with; Vancouver Island is one of the most beautiful places in the world...lets enjoy the day!!! Looking for keen individuals who can routinely start working at 9 am.- rain or shine we are usually outside for part of the day. Initially a one week stay, and if things go well for both of us, then you are most welcome to stay longer.\n\nFrom here you can walk to many nature, ocean and cycling trails.  We are on a bus route to downtown Campbell River, and within 10 minutes you will be in the heart of a beautiful ocean front seaside town.  As well, you can readily experience the alternate vibes of Quadra Island via a 10 min ferry, and then further on to Cortes Island from there.  We are also the gateway to great hiking in Strathcona Park and the surrounding areas.  The west coast and the surfing town of Tofino is a 3 hour drive away and to the North of us is Telegraph Cove, known for whale watching and at the Northern tip of the Island is Port Hardy and the entry point to the Cape Scott Trail (approx 3 hour drive). \n\nWe were new to HelpX summer of 2015 and we have enjoyed meeting many travelers :). We look forward to meeting you and sharing good times and new adventures.  \n",
      "lastLogin": "2021-01-09T18:21:21.740806",
      "allYear": "Most of the year",
      "hideEmail": false,
      "mobile": null,
      "landAreaNumber": null,
      "landAreaUnit": "",
      "educationOffered": null,
      "organicStatus": false,
      "city": "Campbell River, B.C.",
      "createdOn": "2015-04-26T20:00:00",
      "suburb": null,
      "longitude": null,
      "latitude": null
    },
    {
      "applicationUserId": 413380,
      "listingId": 44116,
      "listingName": "Haven Hill Farm",
      "listingTypeName": "Farmstay",
      "countryName": "Canada",
      "regionName": "BC Islands",
      "listingAccommodation": "1 or couple",
      "approvedOn": "2020-02-15T23:12:00",
      "isPremium": false,
      "lastUpdated": "2021-01-08T22:01:28.2697779",
      "mainImageUrl": "https://api.helpx.net/images/listing/medium/818502_Listing.jpg",
      "flagImage": "https://api.helpx.net/images/flag/CAN.png",
      "friendlyUrl": "1249564JG",
      "reviewsReceived": 0,
      "averageRating": null,
      "isFavourite": false,
      "listingDescription": "We raise sheep/lamb and grow food organically.  Our farm is in a beautiful location on SSI  close to the ocean and walking trails through a nature reserve.   We would prefer someone with carpentry/ building experience.  In exchange for living in a 20\" trailer which includes cooking facilities and shower you will work 1-2 days per week depending on how many hours per day you work.",
      "lastLogin": "2021-01-08T21:41:56.103447",
      "allYear": "Yes",
      "hideEmail": false,
      "mobile": null,
      "landAreaNumber": null,
      "landAreaUnit": "",
      "educationOffered": null,
      "organicStatus": true,
      "city": "Salt Spring Island",
      "createdOn": "2020-02-15T19:00:00",
      "suburb": "",
      "longitude": null,
      "latitude": null
    },
    {
      "applicationUserId": 419515,
      "listingId": 50254,
      "listingName": "Silvertip Ranch",
      "listingTypeName": "Farmstay",
      "countryName": "Canada",
      "regionName": "BC South Eastern",
      "listingAccommodation": "1 or 2",
      "approvedOn": "2004-10-03T20:00:00",
      "isPremium": false,
      "lastUpdated": "2021-01-08T16:16:48.3508493",
      "mainImageUrl": "https://api.helpx.net/images/listing/medium/50254_0.jpg",
      "flagImage": "https://api.helpx.net/images/flag/CAN.png",
      "friendlyUrl": "1089050MP",
      "reviewsReceived": 42,
      "averageRating": 4.88,
      "isFavourite": false,
      "listingDescription": " We are accepting helpers in April 2021\n\nIf you like mountains, wildlife and exercise and you are  interested in a true country experience this is the place to be. We would welcome any help and would love people to share their organic knowledge with us. No experience is necessary just enthusiasm and a love of the outdoors. Throughout the year we have a wide variety of tasks to do. \n  In March and April the cows are calving and we often complete some small building projects.\n In May we are preparing the fields for planting; there is ploughing, discing, seeding, picking rocks and setting up the irrigation system. We also plant the large vegetable garden in May and June. For the rest of the summer we are haying, moving irrigation pipes twice daily, building and fixing fences, gardening, hand pulling invasive weed species, and on checking the cattle, harvesting garlic, sometimes traveling to the Farmer`s Market on Saturdays \n  There are tasks for all skill levels and strengths so don`t be afraid to join us.\n\n  Remember that being a farmer is about growing food, thus growing food for the cattle and for ourselves is our main occupation. \n July and the beginning of August are the busiest time of year for the farmer with the 1st cut of hay and stacking the hay in the barns. We will also spend two weeks on a Grassland and Rangeland enhancement project which means the identification and removal of invasive weed species. Participation in this project will help you learn about the grassland ecosystems. In August we usually have time for a camping trip into the mountains. Helpers that don`t mind sharing the meal preparation will be greatly appreciated. \n At least once a week we need to check the cattle up on their summer range.  In September we are harvesting the second crop of hay and also repairing corrals and fences. In October the cattle must be brought back home, the garlic planted, the irrigation system shut down, and all the general maintenance done before the snow arrives.\n\nWe are looking for helpers that wish to participate in the life of a small Canadian cattle farm. This means being flexible and realizing that it is hard to have a set schedule when we are working with livestock. So much also depends on the weather, and we find that our best laid plans often go awry. As a helper noted in his review, life on a farm can seem chaotic to those who are used to the very scheduled work hours of the office job. So we welcome you to life in the great outdoors!\n\nOur ranch is situated in the country, some helpers find it a bit isolated without shops and nightlife but those of you who want to experience a different way of life you will appreciate this. We do travel into town once a week and you are welcome to join us if you feel a bit bushed.\n \nTo arrive at our farm you need to travel to Cranbrook. You can fly into Cranbrook to the Canadian Rockies International Airport from Calgary or Vancouver. We are about 4 hours from Nelson B.C. or 5 hours from Calgary by car. There is a shuttle from Calgary airport to Fernie where we could meet you.   \n We have WIFI now but a small data package so must be careful about how much we are streaming and downloading. If you can`t live without social networking daily then it is probably best not to choose an isolated farm as a host. :-)\n\nWhile staying on our ranch we ask that our helpers refrain from using drugs or alcohol.\n\nEnjoy your own room in the original  farmhouse in one of the most beautiful areas of Canada. On your free days get out and do some hiking in the Rocky Mountains  or just swimming in a nearby mountain lake.  \nAfter  15 years of hosting and much thought we have decided to set a minimum age level of 21 years. \n  \nAfter spending some time in Italy as a helper 12 years ago I have even more appreciation for this wonderful help exchange program. It has been an amazing learning experience for me to participate as a helper. Most of all though, I have even a greater appreciation for all the helpers that have come and stayed with me on our farm. Thank you all again for all you have given us!\n\n\n Details of photos:\n1- Simmental cross heifers testing their boundaries\n2- the last river crossing of the cattle drive up\nto the summer range\n3- the lake ten minutes walk above the farm\n4-  fields in different stages of the haying process\n5- cattle grazing fields in October\n6- fields in the  summer evening. photo by Florian\nPhotos thanks to Ariel and Josu",
      "lastLogin": "2021-01-09T21:06:26.2412779",
      "allYear": "Yes",
      "hideEmail": false,
      "mobile": null,
      "landAreaNumber": null,
      "landAreaUnit": "137",
      "educationOffered": null,
      "organicStatus": true,
      "city": "Fort Steele",
      "createdOn": "2004-10-03T20:00:00",
      "suburb": null,
      "longitude": null,
      "latitude": null
    },
    {
      "applicationUserId": 418157,
      "listingId": 48895,
      "listingName": "Resto-Boutique and Ferme",
      "listingTypeName": "Farmstay",
      "countryName": "Canada",
      "regionName": "Quebec",
      "listingAccommodation": "null",
      "approvedOn": "2017-06-25T01:29:00",
      "isPremium": false,
      "lastUpdated": "2021-01-08T15:25:16.6644632",
      "mainImageUrl": "https://api.helpx.net/images/listing/medium/48895_1.jpg",
      "flagImage": "https://api.helpx.net/images/flag/CAN.png",
      "friendlyUrl": "2099276KW",
      "reviewsReceived": 15,
      "averageRating": 4.73,
      "isFavourite": false,
      "listingDescription": "Allô, je suis Gabrielle, 31 ans, maman de 3 garçons. J`ai ouvert mon restaurant/boutique dans la magnifique région de Charlevoix, 2013 sur la ferme de mes parents dans un village en périphérie de Baie-Saint-Paul : Les Éboulements (+/- 15 min en voiture) et 1h30 de Québec. Ferme que j'ai acquise pour en prendre la relève et l'actualiser doucement. J'aimerais en faire un centre agro-touristique ou il fait bon y vivre! \n\n*** POUR NOUS AIDER :\nAide au service au comptoir à la vente en boutique (viande, productions maisons, produits locaux)\nNourrir et prendre soin des animaux (porcs, moutons, lapins, poulets, pintades, oies et poules actuellement)\nTravail au jardin (planter, entretenir, récolter, transformer) En saison, de mai à octobre.\nDivers travaux de ferme selon la période\nBabysitting des enfants (souvent intégré à notre quotidien ou encore selon le calendrier de leur éducatrice et de l'école)\nOrganisation de l'espace afin d'en maximiser l'utilisation\nDes petits travaux de construction\nBoucherie (aide à l’emballage/soutien au boucher (aka moi-même) ) Nos animaux sont abattus par des professionnels dans une abattoir fédérale controlée afin de pouvoir en faire la revente. Il peut y arriver qu'on abat nous même des animaux pour notre consommation personnel ou pour abréger des souffrances. Aucun helpeur n'a a assister à ça sauf s'il le souhaite. \nPréparation de mets cuisinés en vente en boutique ou pour des services traiteurs\n... les tâches varient selon les besoins des animaux, de la ferme, des saisons, de l’achalandage sur la ferme ...\n\nDans les objectifs à moyen/long terme de la ferme  :  \nRé-organiser la ferme afin quelle soit plus productive avec moins d'animaux afin de limiter l'impact de notre production animale sur l'environnement\nAugmenter le niveau de qualité de vie des animaux et des gens qui en prennent soins \nAménager des systèmes de pâtures efficaces l'été et pratique l'hiver.\nOrganiser un circuit découverte de la vie à la ferme pour les visiteurs et bonifier l'expérience client de la ferme. \nRepenser l'offre gourmande complète sur la ferme en limitant la charge de travail que cela engendre (formule pic-nic, take-out, expérience gastronomique événementielle et sporadique)\nOffrir une boutique de mise en valeur des produits de différents artisans coup de coeur de la région mais aussi de gens inspirant de partout au Québec et potentiellement au Canada. \nMettre à jour les bâtiments afin de leur donner la chance de nous offrir un espace de vie agréable et de les protéger. Les mettre en valeur.\nAjouter une offre d'hébergement à la ferme afin d'offrir des expériences d'immersion complète. \n\nVous pouvez nous aider de différentes manières selon vos envies et compétences : à la ferme, au restaurant/boutique ou à la maison.\n\n*** LA FERME EBOULMONTAISE :\nNée en 1990, c`est ici qu`a été créé l`Agneau de Charlevoix. Pratiquement tout se fait à la ferme, de la découpe à la vente. Nous sommes en plein réaménagement de la ferme suite à l'acquisition par Gabrielle (fille des anciens propriétaires) et Guillaume son conjoint. Plusieurs animaux se trouvent sur la ferme à l'année et d'autres y sont ajoutés l'été pour engraissement seulement. Un jardin de légumes (en saison) cultivés sans pesticides. La mission de la ferme est de faire connaitre ce qu`est l`agriculture aux gens de la place et aux touristes qui la visite. Elle est aussi une pionnière en matière de promotion des producteurs locaux.\nVous pourrez découvrir le terrain de la ferme à travers 2 sentiers pédestres accessibles au public jalonnant la ferme pour un total de 14 km aller/retour dont un qui aboutit sur une magnifique vue sur le Cap Martin. Trainer Flip, la border colle de la ferme, elle vous montrera le chemin avec joie! \n\n*** HÉBERGEMENT :\nEn contre partie de votre aide, vous aurez un toit et les repas copieux qu'aime préparer la famille ou le chef Marc Landry(23 ans de carrière, ayant voyagé dans plusieurs pays pour parfaire son apprentissage) . Dans la maison familiale, sur la Ferme aux Éboulements, l’étage supérieur vous est dédié. Il y a trois chambres partageant une salle de bain. Une chambre avec un lit simple et un lit double ainsi que deux chambres avec un lit double. Nous avons aussi éventuellement possibilité de vous loger à Baie-Saint-Paul. Il y a énormément de place pour que les gens puissent se tenter ou encore stationner leur camping-car à la belle saison. Covoiturage entre Les Éboulements et Baie-St-Paul possible souvent.\n\nPendant vos temps libres, vous aurez la possibilité de faire tout un tas d`activités dans la région : randonnée, escalade, kayak, parcs nationaux, plage, mont de ski, etc.\n\nNous avons déjà hâte de vous rencontrer. Tout le monde est bienvenu, tous les talents sont reconnus.\n\n--------------------------------------------------------------------\n\nYou can help us in different ways according to your desires and skills: on the farm, at the restaurant or at home. .\n\n TO HELP US:\n\nFeed and care for animals\nGardening\nBabysitting of children\nArtistic project, creation\nSmall construction works\n\nWe are looking for people who like animals, adore children (6, 4 and 2years old ), like people in general and love to be a pat of a community\n\nWe need help for the farm with the animals, the restoration / maintenance of the buildings, the customer service, Meals / household and daily tasks for the host and the volunteer, to play with children, to create works / to perform artistic follies in order to create a unique place or mixes farming and culture and where it makes sense to live and stop time\n\nIn the family house, the second floor has been reserved for you. There is three bedrooms and a bathroom. There is a total on 3 double bed and 1 simple. The commune area are shared with the host. We provide you the food for each meal. We all share the meal\n\nI can go pick you up at the bus stop in Baie-Saint-Paul, 15 minutes ago from the farm.\n\nSee you soon :) ",
      "lastLogin": "2021-01-08T15:25:11.3125759",
      "allYear": "Yes",
      "hideEmail": false,
      "mobile": null,
      "landAreaNumber": null,
      "landAreaUnit": "118",
      "educationOffered": null,
      "organicStatus": false,
      "city": "Les Éboulements",
      "createdOn": "2017-06-24T20:00:00",
      "suburb": null,
      "longitude": null,
      "latitude": null
    },
    {
      "applicationUserId": 420176,
      "listingId": 50915,
      "listingName": "Marion Krien",
      "listingTypeName": "Homestay",
      "countryName": "Canada",
      "regionName": "Ontario",
      "listingAccommodation": "1 or 2",
      "approvedOn": "2012-08-15T00:11:00",
      "isPremium": false,
      "lastUpdated": "2021-01-08T15:14:55.8437004",
      "mainImageUrl": "https://api.helpx.net/images/listing/medium/50915_0.jpg",
      "flagImage": "https://api.helpx.net/images/flag/CAN.png",
      "friendlyUrl": "1684338VL",
      "reviewsReceived": 1,
      "averageRating": 5.0,
      "isFavourite": false,
      "listingDescription": "\nMy niece and I have a scenic country home on two acres with spectacular views of rolling hills.  There are excellent hiking and biking trails nearby, and beaches of Lake Simcoe are only 20 minutes away by car, one hour by bike.  We will be happy to drive you there. Two bicycles  and high speed WiFi is available.  We have two dogs and two cats.  We are located one hour north of Toronto - accessible by Go Transit to Newmarket, where we will pick you up. On your days off, we will be happy to take you to Newmarket to catch the train/bus to Toronto. We can do the cooking but are happy to share the cooking, and will welcome any specialties you may have.  We are not vegetarian, vegan or gluten free.  If you are, then you should probably look for a different host. Also please note that this is also a no smoking, no vaping and no drugs home, and that you must have medical insurance for Canada.  Work assignments include weeding, mowing, trimming, painting, window washing, and some housekeeping and dog walking, with 5 hours a day, and 2 days off.    We would really like to have helpers that actually have some experience with the above assignments.  During the winter, that is primarily housekeeping, snow shovelling and dog walking.  We will provide a sunny cheerful room with a double bed and a fabulous view, and a bathroom.  Helpers should be prepared to stay a minimum of 1 month, but we do prefer longer terms.  We look forward to welcoming you into our home and family.  \n\n  \n",
      "lastLogin": "2021-01-10T13:40:52.9997063",
      "allYear": "Yes",
      "hideEmail": false,
      "mobile": null,
      "landAreaNumber": null,
      "landAreaUnit": ".809 hectares (2 acres)",
      "educationOffered": null,
      "organicStatus": false,
      "city": "Zephyr",
      "createdOn": "2012-08-14T20:00:00",
      "suburb": null,
      "longitude": null,
      "latitude": null
    },
    {
      "applicationUserId": 421768,
      "listingId": 52508,
      "listingName": "Petty Catwater - A Rural Retreat",
      "listingTypeName": "Farmstay",
      "countryName": "Canada",
      "regionName": "BC Northern",
      "listingAccommodation": "1 or 2",
      "approvedOn": "2016-09-06T22:31:00",
      "isPremium": false,
      "lastUpdated": "2021-01-08T00:25:44.9112994",
      "mainImageUrl": "https://api.helpx.net/images/listing/medium/52508_1.jpg",
      "flagImage": "https://api.helpx.net/images/flag/CAN.png",
      "friendlyUrl": "785743WY",
      "reviewsReceived": 1,
      "averageRating": 5.0,
      "isFavourite": false,
      "listingDescription": "We are looking to next year now: February and onward. We are particularly interested in hosting someone (or a couple) who will manage and coordinate all garden work in the critical mid-April to mid-July period.\n\nNearly everything we do is in support of one thrill: adventures in food. But rural living out here in mid-nowhere means that there are endless other things to be tasked as well: construction, gardening, maintenance of many sorts, enhancing the natural beauty around us. Chances are that if you could describe a pure-fun, physical job, there would be something here I could offer that might satisfy those urges. If you want to work hard, eat marvelous meals and have a fabulous time in the gardens, the workshop and the kitchen, come join us and get a relaxing feel of rural life.\n\nWe are foodies far from the centres and trying to help create a culture of great food around us: for ourselves and for our friends. We are also trying to make that happen as much as is possible using local foods, neighbour's offerings, and our own produce. That is where we hope you will assist us, working with me in the gardens and workshop and, if you want, bringing your creativity to the kitchen.  Note: we are eclectic omnivores.\n\nPre-season is approaching rapidly; sowing for transplant begins in a bit more than a month and there is much to do to get ready. Still, there is a multitude of other tasks to do: you would also assist in and learn more about woodwork, construction and general maintenance. We have a couple construction projects on the go and always the never-ending need to fix or enhance things around us. We are just starting a major plumbing remodel. \n\nFoodwise you could assist in harvest, processing, canning, drying, fermenting, preserving and storing seasonable abundance; increasing the life of the food we grow or acquire. You could add to your skills in baking, menu design and food presentation, learning from an expert. We usually host at least one  fine-dining dinners each week; if you assist in preparation and/or serving, you share in the gratuities. Regardless, you will be expected to take your share of tasks getting family meals ready and cleaning after. \n\nJenn spent her career as chef in fine dining restaurants and works to recapture the thrill. Something new is always happening in her kitchen either for the market, for our guests or sometimes just for us (and maybe you.) Bruce is a retired industrial forester recruited as sous-chef to Jenn’s insidious intentions. He is also chief labourer, carpenter and general dogs’-body for the plan. You could join our team and help us worry if we have enough pansy's to  garnish the velouté. We like longer-term exchanges (3 weeks or longer) but will consider shorter stays in busy periods.\n\nIncidentally, some might call us off-grid but we are remote only in the sense that there is no major city nearby and no mobile phone service or broadcast television. We have gas in the kitchen, satellite internet and Wi-Fi and pretty well every other city service. All of our interns so far have been able to keep in contact family and friends using Skype or a similar application. We have no livestock but if you like to ride there are many around us that keep extra horses and could offer you a mount.\n",
      "lastLogin": "2021-01-09T01:52:51.9323771",
      "allYear": "maybe",
      "hideEmail": false,
      "mobile": null,
      "landAreaNumber": null,
      "landAreaUnit": "2",
      "educationOffered": null,
      "organicStatus": false,
      "city": "Quesnel",
      "createdOn": "2016-09-06T20:00:00",
      "suburb": "Quesnel",
      "longitude": null,
      "latitude": null
    },
    {
      "applicationUserId": 418925,
      "listingId": 49663,
      "listingName": "Little Atlin Lodge",
      "listingTypeName": "Hospitality",
      "countryName": "Canada",
      "regionName": "Yukon",
      "listingAccommodation": "1 only",
      "approvedOn": "2016-07-02T02:01:00",
      "isPremium": false,
      "lastUpdated": "2021-01-07T15:58:59.1971457",
      "mainImageUrl": "https://api.helpx.net/images/listing/medium/49663_0.jpg",
      "flagImage": "https://api.helpx.net/images/flag/CAN.png",
      "friendlyUrl": "1052427VA",
      "reviewsReceived": 1,
      "averageRating": 5.0,
      "isFavourite": false,
      "listingDescription": "What we offer you:\n- A cute cabin to stay with a wood stove, kitchenette, private bathroom with shower and flush toilet. Limited WiFi available.\n- Complimentary use of a canoe, as long as they are not being used by our guests.\n- Attractive lake front location with hiking opportunities near by.\n- Only 1 hour from Whitehorse.\n- Room and board. You will prepare your breakfast in your cabin. Picnic style lunch and full dinner provided. Snacks and alcoholic beverages are on you.\n\nWhat we expect of you:\n- All round help either in spring or fall. \n\nPLEASE NOTE: due to current Covid-19 Yukon border restrictions - until further notice, we are only open for a helper who is a resident of the Yukon Territory. A helper from another Canadian jurisdiction needs to self isolate in Whitehorse for 14 days before coming out to the lodge. The Canadian border is currently closed to all non-essential international travellers. \n\nIn spring 2021 we will need a hand from late April/early May until end of May.\n\n- We look for people who are hands-on and ready to do variable jobs, mostly outdoors, some indoors. Main spring chores: carpentry, renovations, preparing boats and dock for the summer, landscaping, collecting/preparing campfire wood, cleaning. Main fall chores: preparing firewood for wood stoves, landscaping, mowing, raking, chimney sweeping, winterizing boats and dock, cleaning.\n\nYour help will be highly appreciated!\n \nPlease be flexible with hours: expect to work an average of 6 hours per day, 6 days a week - more or less depending on weather conditions. \nWhen you are off you have the chance to explore the surroundings hiking or canoeing and to enjoy life in your cute cabin, have a campfire...\nWe are a family of 3, parents with a 21 years old son, who is mostly absent. Originally Swiss we speak English and (Swiss)German. In our household live 3 cats.\n\nPlease contact us if you have any questions!",
      "lastLogin": "2021-01-07T15:58:38.979656",
      "allYear": "late April-May/Sept-Oct",
      "hideEmail": false,
      "mobile": null,
      "landAreaNumber": null,
      "landAreaUnit": "2.8",
      "educationOffered": null,
      "organicStatus": false,
      "city": "Whitehorse",
      "createdOn": "2016-07-01T20:00:00",
      "suburb": null,
      "longitude": null,
      "latitude": null
    },
    {
      "applicationUserId": 417340,
      "listingId": 48078,
      "listingName": "Sean and Uli's",
      "listingTypeName": "Farmstay",
      "countryName": "Canada",
      "regionName": "BC South Eastern",
      "listingAccommodation": "1 to 3",
      "approvedOn": "2005-02-17T19:00:00",
      "isPremium": false,
      "lastUpdated": "2021-01-06T20:49:18.6236329",
      "mainImageUrl": "https://api.helpx.net/images/listing/medium/48078_0.jpg",
      "flagImage": "https://api.helpx.net/images/flag/CAN.png",
      "friendlyUrl": "1998797GI",
      "reviewsReceived": 9,
      "averageRating": 4.0,
      "isFavourite": false,
      "listingDescription": "We -- two men, and sometimes our 32-year-old son Etienne, and sometimes an old HelpXer or two who are still coming back -- live in a beautiful old log house on a traditional, self-sufficient, Kootenay homestead.  We've generally got chickens, sheep, ducks, gardens, fruit trees.\n\nWe're in a small community surrounded by wilderness:  Argenta is a friendly place of 120 people — Quakers, hippies and just folks — on the northern tip of Kootenay Lake, at one end of the Earl Grey Trail.  (You can walk here in four days from Invermere, or come the more usual way by road!)\n\nThere's always farm work (gardening, animals, preserving food and lots more) and lots of projects (building, fencing, wilderness trail building...).  And, depending on the season, there's hiking, fishing, canoeing, sailing, skiing, skating and skinny-dipping (yup, lots of naked people here) in one of our ponds or in Kootenay Lake.  We have a lot of homesteading experience and are very happy to share it.  If you're interested in construction, Hurrah! -- We've almost finished our years-long project of building big rock-and-masonry walls under the new woodshed roof!  So all we have to do now is put on the finishing details, such as . . . frame walls between the rock walls and the roof!  (Oh -- and shelves, doors, windows, uh, what else? . . . )\n\nYou get to live in the \"Wwoofer Palace\", the \"Chalet\", a tent or maybe a room in the house.  We've always got good food (vegetarian if necessary).  There's an indoor bathroom, but we often prefer to build a fire under the outdoor hot tub, soak under the sun and stars, and then — maybe! — jump in the pond.  There's a great cob oven (built by a wonderful wwoofer) for baking things like bread and pizza.  We've got a piano, an old pump organ, a harpsichord, two trombones and our voices.\n\nWe love to take HelpXers hiking in the fantastic alpine areas around here.  Forests, mountains, lakes, wildlife, wilderness.\n\nWe usually use English, but at least one person in the house can also communicate in French, German, Spanish or Turkish if you wish.  We welcome all races and nationalities, men and women, fuddyduddies and hippy nudists, gay and straight — all kinds of friendly people.  We invite you to become part of our family for a little while.\n\nWe don't always respond favourably to mass emails or copy-and-paste letters.  If you want us to reply, please send an individual request, and maybe tell us why you're particularly interested in our farm.  Please include the word 'lucky\" in your email, so we know you have read our profile.  Also, please include your email address, so we can send you our information letter -- it has lots of useful information and some pretty pictures.  Thanks!  We look forward to hearing from you!",
      "lastLogin": "2021-01-06T20:43:24.7999259",
      "allYear": "Yes",
      "hideEmail": false,
      "mobile": null,
      "landAreaNumber": null,
      "landAreaUnit": "2",
      "educationOffered": null,
      "organicStatus": true,
      "city": "Argenta",
      "createdOn": "2005-02-17T19:00:00",
      "suburb": null,
      "longitude": null,
      "latitude": null
    },
    {
      "applicationUserId": 417307,
      "listingId": 48045,
      "listingName": "LotusFeast Community House",
      "listingTypeName": "Homestay",
      "countryName": "Canada",
      "regionName": "Ontario",
      "listingAccommodation": "1 or 2",
      "approvedOn": "2013-01-30T23:53:00",
      "isPremium": false,
      "lastUpdated": "2021-01-06T17:24:23.3129759",
      "mainImageUrl": "https://api.helpx.net/images/listing/medium/48045_0.jpg",
      "flagImage": "https://api.helpx.net/images/flag/CAN.png",
      "friendlyUrl": "2097922TJ",
      "reviewsReceived": 16,
      "averageRating": 5.0,
      "isFavourite": false,
      "listingDescription": "Update Nov 26: We have space starting mid Dec.\n\nNote: Due to the ongoing Coronavirus, If you have been not isolating before arriving, we may request that you get a Covid19 test or partially isolate at the house. So far no one living here has gotten sick.\n\nEspecially looking for people with renovation skills/interest for our new kitchen/dining room project that is underway (now until March). Also there is cooking, cleaning and garden work. \n\nNote: We don't always book people many months in advance, we prefer to wait until closer to the start dates so we can see how much space we have. Some people here stay longer than they initially planned so we don't always know the timing of openings long in advance. \n\nIf you would like to help, please let us know your range of availability and preferred length of stay. \n\nWe are a 11-person vegetarian community house in Toronto. My name is Steve and living here is also Adonia, Marius (a work exchanger from Romania here until Spring), Luke (from Canada/Africa), Elia (Russia/Israel), Swetha (from India), and Steven, Vishal, Karma, Sarah (from Canada) plus one shorter term work exchanger.\n\nToronto is a great place to visit with vibrant neighbourhoods, bike-friendly streets, lots of festivals, farmers' markets, waterfront parks and an island park you can reach by ferry. etc.\n\nWe are looking for people who are either older (our house is mostly made up of people in their mid 20's to early 50's) or those in their early 20's who already have some experience living independently.\n\nWe are especially open to people who are keen to try a vegetarian diet and interested in spiritual activities like meditation, chanting, yoga and/or prayer. We are a spiritually-focused house. Most of us practice a faith of one form or another. \n\nWe typically make daily vegan meals (feasts) and often a breakfast or other preparations. We typically shop at farmers' markets and food co-ops.\n\nWe also have an environmental focus -- we are into natural building, avoiding plastic packaging and products, and not wearing/using chemically-scented products.\n\nAre you OK with a chemical-free home? i.e: no perfumes, or scented soups, shampoos? Unless natural and organic. \n\nIncludes high speed internet, house phone and laundry soap. We have guest bikes available. To support a peaceful atmosphere, we are looking for those wanting to live without the distraction or temptation of TV and radio, cigarettes and alcohol.\n\nWe are located on a quiet street (1 block from the subway and very close to downtown). We have a large tree-shaded front porch and back deck. Our three storey house has eight bedrooms, a guest room and two bathrooms (soon to be three). We have an infrared cedar sauna and workshop in the basement.\n\nEcological features include using Bullfrog Power (green energy provider), front load washing machine, clothes lines for drying, low flush toilets, efficient fireplace insert where on cool nights we can burn scrap wood, a vegetable garden, and a low-on-the-food-chain vegetarian/vegan kitchen with an emphasis on organics and locally-grown foods.\n\nHelp: \nWe looking for about 4 hours per day in exchange for a sunny room, full use of the house and basic food ingredients. Our shared food is cooked from scratch, so the more help we get the better we all eat. :-) We can provide some training, and timing of work is flexible.\n\nVolunteer work options: \nVolunteer work options: We currently have plenty of renovation projects. We are working on some major design changes to create some large open spaces within the house (involving demolition, flooring, wiring, plumbing, cabinets, plastering, etc), such as  building a new kitchen and dining area. And later replacing the stairs to the basement.\n\nThere is also cleaning and stuff to make in the kitchen. You can cook a full meal for the entire house, help others cook, or just make single shared items such as a soup, hummus, muffins, etc. We can teach you some of this. \n      Or helping to create recipes and cooking videos.\n     Other possibilities include leading a yoga session, art, crafts, sewing or gardening.",
      "lastLogin": "2021-01-06T17:24:17.6596361",
      "allYear": "Yes",
      "hideEmail": false,
      "mobile": null,
      "landAreaNumber": null,
      "landAreaUnit": "",
      "educationOffered": null,
      "organicStatus": false,
      "city": "Toronto",
      "createdOn": "2013-01-30T19:00:00",
      "suburb": null,
      "longitude": null,
      "latitude": null
    },
    {
      "applicationUserId": 404068,
      "listingId": 34803,
      "listingName": "Tim and Elaine Hunt",
      "listingTypeName": "Other",
      "countryName": "Canada",
      "regionName": "BC Islands",
      "listingAccommodation": "1 or couple",
      "approvedOn": "2016-06-04T02:26:00",
      "isPremium": false,
      "lastUpdated": "2021-01-06T16:54:17.5733176",
      "mainImageUrl": "https://api.helpx.net/images/listing/medium/34803_0.jpg",
      "flagImage": "https://api.helpx.net/images/flag/CAN.png",
      "friendlyUrl": "455938PV",
      "reviewsReceived": 3,
      "averageRating": 5.0,
      "isFavourite": false,
      "listingDescription": "*** HELP WANTED APRIL MAY JUNE JULY AUGUST SEPTEMBER\n\n\nHi we are a middle aged couple, all our children live away from Salt Spring Island and have busy lives , preventing them from coming to help us.  ***\n**Tim is a carpenter, off work  on a disability pension, he has all the skill needed for his projects, he just needs some help.    \n\n Part of our home is rented, we live in a part of the basement. . Helpers wishing to experience Island, living with the locals, and helping around the place, can stay in our camper van, or the loft of our studio, both are unheated, so really only able to accept help in the spring, summer, and early fall!  The whole outside of the house is in need of painting, along with all the out buildings! We  have  a small guest studio in the middle  of a renovation!.  We expect 30 hours a week for volunteer help, any way they want to do that, 6 hours a day for 5 days and two days off, or 10 hours for 3 days and 4 days off?. and we will provide fresh in season fruit and vegetables for snacks, and we offer to prepare 2 meals a day 7 days a week. Volunteers need to make one meal each day them selves, from the food we provide, we are currently trying to be Gluten free and Vegan.\nWe are a short walk into Ganges, and a short distance to the bus route, and we have a bicycle, guests can borrow!\nwith some notice, we can pick you up from the ferry!\n\n ",
      "lastLogin": "2021-01-06T15:23:02.9773049",
      "allYear": "Yes",
      "hideEmail": false,
      "mobile": null,
      "landAreaNumber": null,
      "landAreaUnit": "0.404",
      "educationOffered": null,
      "organicStatus": false,
      "city": "SALT SPRING ISLAND",
      "createdOn": "2016-07-05T20:00:00",
      "suburb": "",
      "longitude": null,
      "latitude": null
    }
  ],
  "showCountAs": "More than 200 results returned",
  "centerLongitude": null,
  "centerLatitude": null,
  "defaultZoom": null
}
